Repository: dxbit/dataexpress
Catalog: _test/languages/*/dataexpress.*.po
Languages: ru

source: Abort
ru: Прервать

source: Abort operation?
ru: Прервать операцию?

source: About
ru: О программе

source: About language
ru: О переводе

source: Author: %s/Version: %s/Description: %s
ru: Автор: %s/Версия: %s/Описание: %s

source: Accept selection <Enter>
ru: Выбрать <Enter>

source: Access
ru: Доступ

source: Access to components
ru: Доступ к компонентам

source: Access to fields
ru: Доступ к полям

source: Access to forms
ru: Доступ к формам

source: Access to reports
ru: Доступ к отчетам

source: Action
ru: Действие

source: Action check
ru: Проверка действия

source: An error occurred while executing action [%s].%s
ru: Во время выполнения действия [%s] произошла ошибка.%s

source: The function requires the following component: %s.
ru: Функция требует следующие компоненты: %s.

source: Could not find an action with the ID %s. Make sure that the corresponding extension is added.
ru: Не удалось найти действие с ID %s. Проверьте, что соответствующее расширение было добавлено.

source: Action not selected
ru: Действие не выбрано

source: Action type
ru: Тип действия

source: Active users
ru: Активные пользователи

source: There are active users in the database. Log into single mode is not possible.
ru: В базе есть активные пользователи. Вход в монопольном режиме невозможен.

# strconsts.rsadd
source: Add
ru: Добавить

source: Add a user-developer
ru: Добавьте пользователя-разработчика

source: Add embedded images
ru: Добавить встроенные изображения

source: Add extensions module
ru: Добавить модуль расширений

source: Add extensions web module
ru: Добавить веб-модуль расширений

source: Add field
ru: Добавить поле

source: Add fields
ru: Добавить поля

source: Add form
ru: Добавить форму

source: Add form module
ru: Добавить модуль формы

source: Add form web module
ru: Добавить веб-модуль формы

source: Add group
ru: Добавить группу

source: Add image
ru: Добавить изображение

source: Addition
ru: Сложение

source: Additional fields in the list
ru: Дополнительные поля в списке

source: DataExpress language files (*.lng)|*.lng
ru: Файлы перевода DataExpress (*.lng)|*.lng

source: Add to existing
ru: Добавлять к существующим

source: Add to filter
ru: Добавить в фильтр

source: Add user module
ru: Добавить модуль пользователя

source: Add value
ru: Добавить значение

source: Add WebMain module
ru: Добавить модуль WebMain

source: Adjust by component width
ru: Установить по ширине компонента

source: When importing, errors occurred. The following rows were not imported:
ru: При импорте произошли ошибки. Следующие строки не были импортированы:

source: Agreement
ru: Соглашение

source: Align Center
ru: Выровнять по центру

source: Alignment
ru: Выравнивание

# strconsts.rsalignmentbottom
source: Bottom
ru: По нижнему краю

source: Left align
ru: По левому краю

source: Right align
ru: По правому краю

# strconsts.rsalignmenttop
source: Top
ru: По верхнему краю

# strconsts.rsall
source: All
ru: Все

source: [All actions]
ru: [Все действия]

source: All expressions
ru: Все выражения

source: All extensions|*.epas;*.wepas|
ru: Все расширения|*.epas;*.wepas|

source: [All fields]
ru: [Все поля]

source: All files (*.*)|*.*
ru: Все файлы (*.*)|*.*

source: All files|*.*
ru: Все файлы|*.*

source: All functions
ru: Все функции

source: All modules|*.pas;*.epas;*.wepas|
ru: Все модули|*.pas;*.epas;*.wepas|

source: [All modules]
ru: [Все модули]

source: Allow change sort
ru: Разрешить менять сортировку

source: Allow columns move
ru: Разрешить перемещать столбцы

source: Allow multiple authorization
ru: Разрешить множественную авторизацию

source: Allow resize edit window
ru: Изменение размера окна редактирования

source: Allow single-user mode
ru: Разрешить монопольный режим

source: [All types]
ru: [Все типы]

source: All values
ru: Все значения

source: Alt. cell background
ru: Альт. фон ячейки

source: Alternate color
ru: Альтернативный цвет

source: Anchors
ru: Якоря

source: An interface with this name exists.
ru: Интерфейс с таким названием существует.

source: API reference
ru: Справочник по API

source: Databases constructor
ru: Конструктор баз данных

source: Description
ru: Описание

source: Append
ru: Добавить

source: Append connection
ru: Добавить подключение

source: Append a connection to an existing database
ru: Добавить подключение к существующей базе данных

source: Append current database
ru: Добавить текущую базу данных

source: Append field
ru: Добавить поле

source: Append source
ru: Добавить источник

source: Application folder
ru: Папка приложения

source: Applications (*.exe)|*.exe|Batch files (*.bat, *.cmd)|*.bat;*.cmd|All files (*.*)|*.*
ru: Приложения (*.exe)|*.exe|Пакетные файлы (*.bat, *.cmd)|*.bat;*.cmd|Все файлы (*.*)|*.*

source: Applications|*
ru: Приложения|*

source: Scripts (*.sh)|*.sh|All files (*.*)|*.*
ru: Скрипты (*.sh)|*.sh|Все файлы (*.*)|*.*

source: Apply filter <Ctrl-Enter>
ru: Применить фильтр <Ctrl-Enter>

source: Apply condition of selection to objects
ru: Применить условие отбора к объектам

source: Apply selection
ru: Применить отбор

source: Path
ru: Путь

# strconsts.rsapptype
source: Type
ru: Тип

source: Area
ru: С областями

source: Area lines
ru: Линии области

source: Argument expected.
ru: Ожидается аргумент.

source: A role with this name exists.
ru: Роль с таким названием существует.

source: Around
ru: Вокруг

source: Array name
ru: Имя массива

source: Articles
ru: Статьи

source: Aspect Ratio
ru: Сохранять пропорции

source: A user with this name exists.
ru: Пользователь с таким именем существует.

source: Author
ru: Автор

# strconsts.rsauto
source: Auto
ru: Авто

# strconsts.rsautotaborder
source: Set tab order automatically
ru: Установить порядок перехода автоматически

source: Average
ru: Среднее

source: Axis line
ru: Линия оси

source: Back color
ru: Цвет фона

source: Background
ru: Фон

source: Balance
ru: Баланс

source: Beginning of month
ru: Начало месяца

source: Begin value
ru: Начальное значение

source: Beginning of week
ru: Начало недели

source: Beginning of year
ru: Начало года

source: Bold <Ctrl-B>
ru: Жирный <Ctrl-B>

source: Boolean
ru: Логическое

source: Bottom center
ru: Внизу

source: Bottom left
ru: Внизу слева

source: Bottom right
ru: Внизу справа

source: Bottom side
ru: Нижняя сторона

source: Breakpoints
ru: Точки остановки

source: Bring to front
ru: Наверх

source: Build area
ru: Область построения

source: Built-in actions
ru: Встроенные действия

source: Button
ru: Кнопка

source: Button action
ru: Действие кнопки

source: Button actions
ru: Действия кнопки

source: Buttons
ru: Кнопки

source: By center
ru: По центру

source: Cache metadata
ru: Кэшировать метаданные

source: The current record is being edited. Calling the function will implicitly save the record without checking the data entry.
ru: Текущая запись редактируется. Вызов функции приведет к неявному сохранению записи без проверки ввода данных.

source: Calculation field: %s
ru: Вычисляемое поле: %s

source: A calculation field with the same field name already exists.
ru: Вычисляемое поле с таким именем уже существует.

source: Calculated fields
ru: Вычисляемые поля

source: A calculation field with the same SQL field name already exists.
ru: Вычисляемое поле с таким SQL-именем уже существует.

source: A calculation label with same caption already exists.
ru: Вычисляемая надпись с таким текстом уже существует.

source: This property is not available, because a calculation label same caption already exists.
ru: Это свойство недоступно, т. к. вычисляемая надпись с таким текстом уже существует.

source: Calculation labels
ru: Вычисляемые надписи

source: Calculations when printing
ru: Вычисления при печати

source: Call function
ru: Вызвать функцию

source: Callout angle
ru: Угол выноски

# strconsts.rscancel
source: Cancel
ru: Отмена

source: Are you sure you want to cancel adding fields?
ru: Вы точно хотите отменить добавление полей?

source: Cancel changes
ru: Отменить изменения

source: Cancel changes <Shift-Esc>
ru: Отменить изменения <Shift-Esc>

source: Are you sure want to cancel the changes?
ru: Вы точно хотите отменить изменения?

source: Canceled by user.
ru: Прервано пользователем.

source: Cancel selection <Esc>
ru: Отменить выбор <Esc>

source: Can not change source because object fields are used in query/report [%s].
ru: Нельзя изменить источник, потому что поля объекта используются в запросе/отчете [%s].

source: Can not clean temporary directory %s
ru: Не удалось очистить временную папку %s

source: Can not create temporary directory %s
ru: Не удалось создать временную папку %s

source: Can not delete the file.
ru: Не могу удалить файл.

source: [Can not get value]
ru: [Не удается получить значение]

source: Cannot use both function and grouping by date.
ru: Нельзя одновременно использовать функцию и группировку по дате.

source: You can rename the label to open the expression editor.
ru: Можно переименовать надпись, чтобы открыть редактор выражений.

source: Can not copy file %s.
ru: Не могу скопировать файл %s.

source: Can not copy file from %s to %s.
ru: Не могу скопировать файл из %s в %s.

source: You can not delete the current connection.
ru: Вы не можете удалить текущее подключение.

source: On that record referenced %s can not be deleted.
ru: На запись ссылается %s - не могу удалить.

source: Can not delete field [%s], because it used in %s.
ru: Не могу удалить поле [%s], потому что оно используется в %s.

source: Can not delete form [%s], because it used in %s.
ru: Не могу удалить форму [%s], потому что она используется в %s.

source: queries:%s
ru: запросах:%s

source: reports:%s
ru: отчетах:%s

source: You can not delete this record. Access denied.
ru: Вы не можете удалить эту запись. Доступ закрыт.

source: Can not download help index. Check the connection to the Internet. Error message: %s
ru: Не удается скачать указатель справки. Проверьте подключение к Интернет. Сообщение об ошибке: %s

source: You can not hide this field because it is used in actions.
ru: Нельзя скрыть это поле, потому что оно используется в действиях.

source: You cannot make a memo unlimited, since it is used in the following components:%sThese components can not be used unlimited memo.
ru: Нельзя сделать заметку неограниченной, т. к. она используется в следующих компонентах:%sВ этих компонентах нельзя использовать неограниченные заметки.

source: Can not move a group. This group already exists.
ru: Нельзя переместить группу. Такая группа уже есть.

source: You can not rename the report because the program can not rename it in related actions. This operation only works in designer mode.
ru: Не удается переименовать отчет, потому что программа не может его переименовать в связанных действиях. Эта операция работает только в режиме дизайнера.

source: The field was renamed, but the program can not rename it in linked actions, because this operation only works in designer mode. Incorrect field names can lead to errors in the work actions. Unfortunately, you can not save selection settings with new field names in user mode.
ru: Было переименовано поле, но программа не может переименовать его в связанных действиях, потому что эта операция работает только в режиме дизайнера. Некорректные имена полей могут привести к ошибкам в работе действий. К сожалению, нельзя сохранить настройки отбора с новыми именами полей в режиме пользователя.

source: You cannot replace an unlimited memo with another component.
ru: Нельзя заменить бесконечную заметку на другой компонент.

# strconsts.rscaption
source: Caption
ru: Надпись

source: Caption subtotal
ru: Надпись промежуточного итога

source: Case sensitive
ru: Учитывать регистр

source: Categories
ru: Категории

source: Category axis
ru: Ось категорий

source: Cell background
ru: Фон ячейки

source: Cell [%s] is required.
ru: Ячейка [%s] обязательна для заполнения.

source: Cell size
ru: Размер ячейки

source: Center
ru: По центру

source: Center left
ru: Слева

source: Center right
ru: Справа

source: Center text
ru: Текст в центре

source: Change connection settings or group name
ru: Изменить параметры подключения или имя группы

source: Change counter
ru: Изменить счетчик

source: You have changed the source data object. If the above actions are used object field, the action may not work properly.
ru: Вы изменили источник данных объекта. Если в выше перечисленных действиях используются поля объекта, то действия могут работать некорректно.

source: The database project was modified by another instance of the program. Changing the database design together will lead to errors and data loss! You should reconnect to the database to get the latest project changes.
ru: Проект базы данных был изменен другим экземпляром программы. Совместное изменение проекта базы данных приведет к ошибкам и потере данных! Вам следует заново подключиться к базе данных, чтобы получить последние изменения проекта.

source: Project changes are prohibited!
ru: Изменение проекта запрещено!

source: Change password
ru: Изменить пароль

source: Character for blanks
ru: Символ пробела

source: Expected left brace {.
ru: Ожидается левая фигурная скобка {

source: Expected right brace }.
ru: Ожидается правая фигурная скобка }

source: Chart
ru: Диаграмма

source: Chart not found: %s
ru: Диаграмма не найдена: %s

source: Chart type
ru: Тип диаграммы

source: Check all
ru: Отметить все

source: Checkbox
ru: Флажок

source: Check database files
ru: Отметить файлы БД

source: Records with an empty object are detected. When the "Required" property is set, these entries may not be visible.
ru: Обнаружены записи с пустым объектом. При установленном свойстве "Обязательное" эти записи могут быть не видны.

# strconsts.rscheckexpr
source: Check
ru: Провека

source: Checking data...
ru: Проверка данных...

# strconsts.rscheckresizefieldserror
source: Failed to save project. Unable to resize the following fields:
ru: Невозможно сохранить проект. Не удается изменить размер следующих полей:

source: Check unique
ru: Контроль уникальности

source: Check updates
ru: Проверка обновлений

source: Check value
ru: Проверка значения

source: Chocolate
ru: Плитка

source: Circle
ru: Круг

source: A circular link between the field %s and the query [%s] was found.
ru: Обнаружена циклическая связь между полем %s и запросом [%s].

source: Detected circular reference between modules %s and %s.
ru: Обнаружена циклическая ссылка между модулями %s и %s.

# strconsts.rsclear
source: Clear
ru: Очистить

source: Clear all values
ru: Очистить все значения

source: Are you sure you want to clear all values?
ru: Вы точно хотите очистить все значения?

source: Clear fields
ru: Очистить поля

source: Clear all filters
ru: Очистить все фильтры

source: Clear history
ru: Очистить историю

source: You want to clear the history of recently opened databases. Continue?
ru: Вы собираетесь очистить историю недавно открытых баз данных. Продолжить?

# strconsts.rsclearimage
source: Clear
ru: Очистить

source: Clear selection
ru: Снять выделение

source: Are you sure you want to reset all settings?
ru: Вы точно хотите сбросить все установки?

source: Clear table
ru: Очистить таблицу

source: Clear table before filling
ru: Очищать таблицу перед заполнением

source: Are you sure you want to clear the entire table?
ru: Вы точно хотите очистить всю таблицу?

source: Clear value
ru: Очистить значение

source: Click to load image
ru: Щелкните для загрузки изображения

source: Close
ru: Закрыть

# strconsts.rscloseeditwindowhint
source: Close window <Shift-Esc>
ru: Закрыть окно <Shift-Esc>

source: Close window <Esc>
ru: Закрыть окно <Esc>

# strconsts.rscmptype
source: Type
ru: Тип

source: %s [%s] is used in actions:%s%s
ru: %s [%s] используется в действиях:%s%s

source: Code folding
ru: Сворачивание кода

source: Collapse all
ru: Свернуть все

source: Color
ru: Цвет

source: Coloring
ru: Раскраска

source: Column
ru: Столбец

source: Column color
ru: Цвет столбца

source: Column font
ru: Шрифт столбца

source: Columns
ru: Столбцы

source: Column width
ru: Ширина столбца

source: Column width total
ru: Ширина столбца итога

source: Comma expected.
ru: Ожидается запятая.

source: Comment
ru: Комментарий

source: Common parameters
ru: Общие параметры

source: Compare and edit selected roles
ru: Сравнение и редактирование выбранных ролей

source: Compilation is successful.
ru: Компиляция успешно завершена.

source: Compile
ru: Компилировать

source: During script compilation errors have been detected. If you see this window after updating the application, then most likely there are changes in the application that make your script incompatible. To solve the problem, contact the developer of the module in which the error occurred.
ru: Во время компиляции скриптов были найдены ошибки. Если вы видите это окно после обновления приложения, то скорее всего в приложении произошли изменения, делающие ваш скрипт несовместимым. Для решения проблемы обратитесь к разработчику модуля, в котором произошла ошибка.

source: Compiler messages
ru: Сообщения компилятора

source: Component
ru: Компонент

source: A component with the same field name already exists.
ru: Компонент с таким именем поля уже существует.

source: Component name
ru: Имя компонента

source: Component name is empty.
ru: Имя компонента пустое.

source: Component [%s] not found.
ru: Компонент [%s] не найден.

source: Component not found. Unable to determine component type.
ru: Компонент не найден. Невозможно определить тип компонента.

source: Components
ru: Компоненты

source: Component with the specified field name [%s] not found.
ru: Компонент с указанным именем поля [%s] не найден.

source: Condition
ru: Условие

source: Confirmation
ru: Подтверждение

source: Confirmation message
ru: Подтверждающее сообщение

source: Save changes?
ru: Сохранить изменения?

source: Confirm autosave record
ru: Подтверждение автосохранения записи

source: Confirm cancel editing
ru: Подтверждение отмены редактирования

source: Cancel changes?
ru: Отменить изменения?

source: Confirm delete.
ru: Подтвердите удаление.

source: One or more tables contain data. Are you sure you want to delete this record?
ru: Одна или более таблиц содержит данные. Вы точно хотите удалить эту запись?

source: Do you want to delete group?
ru: Вы хотите удалить группу?

source: Are you sure you want to delete the image?
ru: Вы точно хотите удалить изображение?

source: Confirm when application exit
ru: Подтверждать при выходе из программы

source: Continue saving changes?
ru: Продолжить сохранение изменений?

source: Confirm save record
ru: Подтверждение сохранения записи

source: Connect
ru: Подключиться

source: One or more connections with the same database location and user name were found: %s Do you want to add a new connection anyway?
ru: Найдено одно или более подключений с такими же расположением базы данных и именем пользователя: %s Все равно добавить новое подключение?

source: Connection [%s] has been already added.
ru: Подключение [%s] уже добавлено.

source: Connection error
ru: Ошибка соединения

source: Filter by connection name or database location
ru: Фильтр по имени подключения или расположению базы данных

source: Connection name
ru: Имя подключения

source: %s - copy
ru: %s - копия

source: This connection name already exists.
ru: Такое имя подключения уже существует.

source: You can not use character | in connection name
ru: Нельзя использовать символ | в имени подключения

source: Connection [%s] not found.
ru: Подключение [%s] не найдено.

source: One or more connections with the same database location and user name were found: %s Do you want to save this connection anyway?
ru: Найдено одно или более подключений с такими же расположением базы данных и именем пользователя: %s Все равно сохранить это подключение?

source: Connection settings
ru: Параметры подключения

source: Connect to database
ru: Подключиться к базе данных

source: Connect to database...
ru: Подключение к базе данных...

source: Contained in the list
ru: Содержится в списке

source: Containing text
ru: Содержит текст

source: Content
ru: Содержимое

source: Contents
ru: Содержание

source: Continue
ru: Продолжить

source: To continue importing anyway, click [Continue]. The rows containing errors will not be imported.
ru: Для продолжения импорта нажмите [Продолжить]. Строки, содержащие ошибки, не будут импортированы.

source: Continue to merge projects?
ru: Продолжить объединение проектов?

source: Continue running <F9>
ru: Продолжить выполнение <F9>

source: Continue to delete?
ru: Продолжить удаление?

source: Copy
ru: Копировать

source: Copy cells
ru: Копировать ячейки

source: Copy connection
ru: Копировать подключение

source: Copy form style
ru: Копировать стиль формы

# strconsts.rscopyreportstyle
source: Copy style
ru: Копировать стиль

source: Copyright © 2015-2025 Pavel Duborkin
ru: Copyright © 2015-2025 Павел Дуборкин

# strconsts.rscopystyle
source: Copy style
ru: Копировать стиль

source: Copy tag end
ru: Копировать тег end

source: Copy tag form
ru: Копировать тег form

source: Copy tag grid
ru: Копировать тег grid

source: Copy tag group
ru: Копировать тег group

source: Copy to paste in the script
ru: Копировать для вставки в скрипт

source: Copy URL to clipboard
ru: Копировать ссылку в буфер обмена

source: Corner
ru: Угол

source: Could not create folder: %s
ru: Не могу создать папку: %s

source: Could not find form or report.
ru: Не удалось найти форму или отчет.

source: Count
ru: Количество

source: Counter
ru: Счетчик

# strconsts.rscountfieldname
source: Total
ru: Итог

source: Create
ru: Создать

source: Create new database
ru: Создать новую базу данных

source: The form module [%s] has not yet been created. Create a module?
ru: Модуль формы [%s] ещё не был создан. Создать модуль?

source: Cross
ru: Клетка

source: The settings for the current connection have been changed. Reconnect to make the changes take effect.
ru: Параметры текущего подключения были изменены. Переподключитесь, чтобы изменения вступили в силу.

source: Current form
ru: Текущая форма

source: Current report
ru: Текущий отчет

source: Current time
ru: Текущее время

source: Cursor position
ru: Позиция курсора

source: Cut
ru: Вырезать

source: Dash
ru: Штрих

source: Dash dot
ru: Точка тире

source: Dash dot dot
ru: Точка точка тире

# strconsts.rsdataarea
source: Data
ru: Данные

# strconsts.rsdatabaseconnectlost
source: Unable to establish a connection to the database. Make sure that the database server is available and run the application again.
ru: Не удается установить связь с базой данных. Убедитесь в доступности сервера баз данных и запустите приложение снова.

source: Data cannot be grouped by file or image.
ru: Данные не могут быть сгруппированы по файлу или изображению.

source: Data delimiter
ru: Разделитель данных

source: An error occured when importing data.
ru: При импорте данных произошла ошибка.

# strconsts.rsdatamenu
source: Data
ru: Данные

source: Data source
ru: Источник данных

source: Data sources
ru: Источники данных

source: Data type
ru: Тип данных

source: Date
ru: Дата

source: Date field not found.
ru: Поле даты не найдено.

source: Date field should be visible.
ru: Поле даты должно быть видимым.

source: DBAVG - calculate average value
ru: DBAVG - вычислить среднее значение

source: DBCOUNTD - count of distinct
ru: DBCOUNTD - количество различных

source: DBCOUNT - count
ru: DBCOUNT - посчитать

source: DB-function
ru: DB-функция

source: DBGETBYID - get field value by id of record
ru: DBGETBYID - получить значение поля по ID записи

source: DBGET - get field value
ru: DBGET - получить значение поля

source: DBGETID - get id of record
ru: DBGETID - получить ID записи

source: The database is into single-user mode. Log is not possible.
ru: База данных находится в монопольном режиме. Вход невозможен.
