Repository: dxbit/dataexpress
Catalog: _test/languages/*/dataexpress.*.po
Languages: ru

source: Double-click to change
ru: Двойной клик для изменения

source: Database location
ru: Расположение базы данных

source: DBMAX - maximum value
ru: DBMAX - максимальное значение

source: DBMERGEALL - merge all values
ru: DBMERGEALL - соединить все значения

source: DBMERGE - merge distinct values
ru: DBMERGE - соединить различные значения

source: DBMIN - minimum value
ru: DBMIN - минимальное значение

source: Database %s not found.
ru: База данных %s не найдена.

source: Database is not supported by this version of DataExpress. Save the database in the DataExpress version dated 02.11.2018 and try again.
ru: База данных не поддерживается этой версией DataExpress. Сохраните базу данных в версии DataExpress от 02.11.2018 и попробуйте снова.

source: Database path
ru: Путь к базе данных

source: Field [%s] is incompatible with the function. The function works only with fields of the "Number" type.
ru: Поле [%s] несовместимо с функцией. Функция работает только с полями типа "Число".

source: DBSUM - calculate sum
ru: DBSUM - вычислить сумму

source: Day
ru: День

source: Half-Year
ru: Полугодие

source: Month
ru: Месяц

source: Quarter
ru: Квартал

source: Week
ru: Неделя

source: Year
ru: Год

source: Debug: %s [%s]
ru: Отладка: %s [%s]

source: Default
ru: По умолчанию

source: Default image
ru: Изображение по умолчанию

source: (Default)
ru: (по умолчанию)

source: Default password
ru: Пароль по умолчанию

# strconsts.rsdefaultrpcolcaption
source: Field
ru: Поле

source: Default title
ru: Заголовок по умолчанию

source: Default value
ru: Значение по умолчанию

source: Delete condition
ru: Условие удаления

# strconsts.rsdelete
source: Delete
ru: Удалить

source: Delete all
ru: Удалить все

source: Are you sure you want to remove all breakpoints?
ru: Вы точно хотите удалить все точки останова?

source: Are you sure you want to remove the breakpoint?
ru: Вы точно хотите удалить точку останова?

# strconsts.rsdeletecomponents
source: Delete
ru: Удалить

source: Delete connection information from list?
ru: Удалить информацию о подключении из списка?

source: Delete connection or empty group
ru: Удалить подключение или пустую группу

source: Some expressions and actions may stop working. Do you really want to delete this module?
ru: Некоторые выражения и действия могут перестать работать. Вы точно хотите удалить этот модуль?

source: Note: the changes will take effect the next time you connect to the database.
ru: Примечение: изменения вступят в силу при следующем подключении к базе данных.

source: Delete field
ru: Удалить поле

source: Are you sure you want to delete the field?
ru: Вы точно хотите удалить поле?

source: Delete form
ru: Удалить форму

source: Delete group
ru: Удалить группу

source: Access to the table [%s] is limited. Deleting is not possible.
ru: Доступ к таблице [%s] ограничен. Удаление невозможно.

source: Are you sure you want to delete the record?
ru: Вы точно хотите удалить запись?

source: Delete records
ru: Удаление записей

source: An error occured when deleting records.
ru: При удалении записей произошла ошибка.

source: Delete source
ru: Удалить источник

source: Delete value
ru: Удалить значение

source: Deleting
ru: Удаление

source: Deleting all breakpoints
ru: Удалить все точки остановки

source: Deleting breakpoint
ru: Удалить точку остановки

source: Delimiter
ru: Разделитель

source: I confirm deletion
ru: Я подтверждаю удаление

source: Do you want to delete all records selected current filters. The data will be deleted forever. Are you sure?
ru: Вы хотите удалить все записи, выбранные текущим фильтром. Данные будут удалены навсегда. Вы уверены?

source: Density, %
ru: Плотность, %

source: Depth
ru: Объем

source: Designer
ru: Дизайнер

source: Destination field not selected.
ru: Поле целевой таблицы не выбрано.

source: Destination
ru: Назначение

source: Destination forms
ru: Формы-получатели

source: Destination queries
ru: Запросы-получатели

source: Destination reports
ru: Отчеты-получатели

source: Destination table
ru: Целевая таблица

source: Destination table not selected.
ru: Целевая таблица не выбрана.

source: Detailing period
ru: Детализация периода

# strconsts.rsdeveloper
source: Developer
ru: Разработчик

source: Diagonal to left lines
ru: Диагональные линии влево

source: Diagonal to right lines
ru: Диагональные линии вправо

# strconsts.rsdialogfilter
source: DataExpress databases (*.fdb)|*.fdb;*.FDB|All files (*.*)|*.*
ru: Базы данных DataExpress (*.fdb)|*.fdb;*.FDB|Все файлы (*.*)|*.*

source: All DataExpress databases (*.dxdb, *.fdb)|*.dxdb;*.DXDB;*.fdb;*.FDB|
ru: Все базы данных DataExpress (*.dxdb, *.fdb)|*.dxdb;*.DXDB;*.fdb;*.FDB|

source: New DataExpress databases (*.dxdb)|*.dxdb;*.DXDB|
ru: Новые базы данных DataExpress (*.dxdb)|*.dxdb;*.DXDB|

source: Diamond
ru: Ромб

source: Disabled
ru: Отключено

source: Disable Tab stop in non-editable fields
ru: Отключить переход по Tab в нередактируемых полях

source: Disable Tab stop in non-editable fields?
ru: Отключить переход по Tab в нередактируемых полях?

source: Display
ru: Отображать

source: Distance
ru: Отступ

source: Distance to axis
ru: Отступ от оси

source: Distinct count
ru: Количество уникальных

source: Division
ru: Деление

source: Division by zero.
ru: Деление на нуль.

source: Donate
ru: Поддержать проект

source: Do not show in user list
ru: Не показывать в списке пользователей

source: Shrink only (no stretch)
ru: Только сжатие (не растягивать)

source: Dot
ru: Точка

source: Download
ru: Скачать

source: Download updates...
ru: Загрузка обновлений...

source: The following extensions have been imported into the database:
ru: Следующие расширения были импортированы в базу данных:

source: The following extensions will be imported into the database:%sContinue?
ru: Следующие расширения будут импортированы в базу данных:%sПродолжить?

source: The following files are not supported and have not been processed:%sOnly extension modules *.epas are supported.
ru: Следующие файлы не поддерживаются и не были обработаны:%sПоддерживаются только модули расширений *.epas.

source: Background image
ru: Фоновое изображение

# strconsts.rsdsgnfile
source: File
ru: Файл

source: Duplicate
ru: Дублировать

source: Duplicate all
ru: Дублировать все

source: A component name already exists.
ru: Имя компонента уже существует.

source: Duplicate field
ru: Дублирование поля

source: Duplicate field name.
ru: Дублирование имени поля.

source: Duplicate SQL field name.
ru: Дублирование SQL-имени поля

source: DataExpress website
ru: Сайт DataExpress

source: DataExpress update is available. Do you want to start the update?
ru: Доступно обновление DataExpress. Вы хотите начать обновление?

source: Edges
ru: Края

# strconsts.rsedit
source: Edit
ru: Изменить

source: Editable
ru: Разрешить редактирование

source: Editable records
ru: Редактируемые записи

source: Edit condition
ru: Условие редактирования

source: Editing
ru: Редактирование

source: %s (Editing)
ru: %s (Редактирование)

source: Edit mask
ru: Маска ввода

source: Compare and edit roles
ru: Сравнение и редактирование ролей

source: Effects
ru: Эффекты

source: Elapsed time
ru: Прошло времени

source: %d elements
ru: %d элементов

source: Element not found.
ru: Элемент не найден.

source: Ellipse
ru: Эллипс

source: Ellipsis in cell
ru: Многоточие в ячейке

source: Else
ru: Иначе

source: Else If
ru: Иначе Если

source: Else If %s
ru: Иначе Если %s

source: Empty
ru: Пусто

source: After exiting the designer empty groups are not saved: %sContinue?
ru: После выхода из дизайнера пустые группы не будут сохранены: %sПродолжить?

source: Empty square brackets detected
ru: Обнаружены пустые квадратные скобки

source: Encoding
ru: Кодировка

source: Endings _not, _null, _text, _begin, _end in field names are reserved by the report printing subsystem.
ru: Окончания _not, _null, _text, _begin, _end в именах полей зарезервированы подсистемой печати отчетов.

source: Expected end of line.
ru: Ожидается конец строки.

source: End tag without begin tag.
ru: Тег End без начального тега.

source: Enter array name.
ru: Введите имя массива.

# strconsts.rsentercaption
source: Enter caption
ru: Введите надпись

source: Enter column title
ru: Введите заголовок столбца

source: Enter connection name.
ru: Введите имя подключения.

source: Enter database location.
ru: Введите расположение базы данных.

source: Enter delimiter.
ru: Введите разделитель.

source: Enter expression
ru: Введите выражение

source: Enter extension name.
ru: Введите название расширения.

source: Enter field name
ru: Введите имя поля

source: Enter field size
ru: Введите размер поля

source: Enter filter name
ru: Введите название фильтра

source: Enter form name
ru: Введите имя формы

source: Enter function name.
ru: Введите имя функции.

source: Enter group name
ru: Введите название группы

source: Enter image name
ru: Введите имя изображения

source: Enter minimal and maximal value
ru: Введите минимальное и максимальное значения

source: Enter name
ru: Введите имя

source: Enter precision of number
ru: Введите точность числа

source: Enter password
ru: Введите пароль

source: Enter query name
ru: Введите имя отчета

source: Enter search text
ru: Введите искомый текст

source: Enter text
ru: Введите текст

source: Enter type name.
ru: Введите имя типа.

source: Enter username
ru: Введите имя пользователя

source: Enter value
ru: Введите значение

source: Enter variable name.
ru: Введите имя переменной.

source: Entire scope
ru: Во всем тексте

# strconsts.rsequal
source: Equal
ru: Равно

source: Can not connect to database: %s.%s
ru: Не могу подключиться к базе данных: %s.%s

source: Can not connect to updates database: %s.
ru: Не удалось подключиться к базе обновлений: %s

source: Can not create database: %s.%s
ru: Не удалось создать базу данных: %s.%s

source: Can not create updates database: %s.
ru: Не удалось создать базу обновлений: %s.

source: Some records have not been deleted.
ru: Некоторые записи не были удалены.

source: The error occurred in the following tag:
ru: Ошибка возникла в следующем теге:

source: Error
ru: Ошибка

source: Error in calculated field [%s]:
ru: Ошибка в вычисляемом поле [%s]:

source: Error occured when checking database.%s
ru: Произошла ошибка во время проверки базы данных.%s

source: An error occurred while closing the application.
ru: Во время закрытия приложения произошла ошибка.

source: An error occurred while closing the database.
ru: Во время закрытия базы данных произошла ошибка.

source: An error occurred while creating tab [%s].%s
ru: При создании закладки [%s] возникла ошибка.%s

source: Error details:
ru: Подробности ошибки:

source: Expression:
ru: Выражение:

source: The expression contains an error:%sYou want to fix it?
ru: Выражение содержит ошибку:%sВы хотите ее исправить?

source: Error in field [%s]: %s
ru: Ошибка в поле [%s]: %s

source: Error in the filter source table. Object is %s
ru: Ошибка в фильтре таблицы-источника. Объект %s

source: Error while loading library %s. Error message: %s
ru: Ошибка при загрузке библиотеки %s. Сообщение об ошибке: %s

source: Error occured when loading metadata.%s
ru: Произошла ошибка при загрузке метаданных.%s

source: Error logging
ru: Логирование ошибок

source: Error message: %s
ru: Сообщение об ошибке: %s

source: Error:
ru: Ошибка:

# strconsts.rserrorreadingcfg
source: Unable to read settings from dataexpress.cfg file. Maybe the file is being used by another process. Error message:%s
ru: Не удается прочитать настройки из файла dataexpress.cfg. Возможно файл используется другим процессом. Сообщение об ошибке:%s

source: Error reading form metadata: %sPerhaps you are trying to open a database created in a newer version of the application. Make sure you are using the latest version of the application.
ru: Ошибка чтения метаданных формы: %sВозможно вы пытаетесь открыть базу данных, созданную в новой версии приложения. Убедитесь, что вы используете последнюю версию приложения.

source: An error occurred while the database was running.%sPress Shift key while opening the database to enter the Designer.
ru: Во время запуска базы данных произошла ошибка.%sНажмите клавишу Shift во время открытия базы данных, чтобы войти в дизайнер.

source: An error was found in the selection condition: %sIn this regard, the selection condition will be ignored.
ru: В условии отбора найдена ошибка: %sВ связи с этим условие отбора будет проигнорировано.

source: Errors in expressions
ru: Ошибки в выражениях

source: Errors occured.
ru: Возникли ошибки.

source: An error occured when importing module.
ru: Произошла ошибка во время импорта модуля.

source: An error occurred while disconnecting from the database.
ru: Во время отключения от базы данных произошла ошибка.

source: An error occurred while dragging and dropping files.
ru: Во время перетаскивания файлов произошла ошибка.

# strconsts.rserrorwritingcfg
source: Unable to write settings to dataexpress.cfg file. Maybe the file is being used by another process. Error message:%s
ru: Не удается записать настройки в файл dataexpress.cfg. Возможно файл используется другим процессом. Сообщение об ошибке:%s

source: Example
ru: Пример

source: Example: My Database
ru: Пример: Моя база данных

source: Example: computer_name:d:\mybases\mydb.fdb or 10.20.11.15:/home/user/base.fdb or e:\localdb\db.fdb
ru: Пример: имя_компьютера:d:\mybases\mydb.fdb or 10.20.11.15:/home/user/base.fdb or e:\localdb\db.fdb

source: Exception class: %s
ru: Класс исключения: %s

source: You are trying to exchange the old and new rows. You must first save the record. Continue?
ru: Вы пытаетесь поменять старую и новую строки. Сначала Вы должны сохранить запись. Продолжить?

source: Execute action %s failed in the extension module %s. Try to find and remove the module that causes the error.
ru: Сбой выполнения действия %s в модуле расширения %s. Попробуйте найти и удалить модуль, вызывающий ошибку.

source: Execution condition
ru: Условие выполнения

source: Execute SQL <F9>
ru: Выполнить SQL <F9>

source: Exit
ru: Выход

source: You are sure to exit
ru: Вы уверены, что хотите выйти?

source: Expand all
ru: Раскрыть все

source: Expand levels
ru: Раскрыть уровни

source: Expected closing bracket or operation.
ru: Ожидается закрывающая скобка или операция.

source: Expected operation or detected excess closing bracket.
ru: Ожидается операция или обнаружена лишняя закрывающая скобка.

source: Expert mode
ru: Режим эксперта

source: Can not create file: %s. The export operation will be aborted.
ru: Не могу создать файл: %s. Операция экспорта будет прервана.

source: Can not create folder: %s. The export operation will be aborted.
ru: Не могу создать папку: %s. Операция экспорта будет прервана.

source: Export data
ru: Экспорт данных

source: An error occured when exporting data.
ru: При экспорте данных произошла ошибка.

source: Export module
ru: Экспорт модуля

source: Export of project was successfull.
ru: Экспорт проекта успешно завершен.

source: Export Project
ru: Экспорт проекта

source: An error occured when exporting project.
ru: При экспорте проекта произошла ошибка.

source: Data has been successfully exported to a file %s.
ru: Данные успешно экспортированы в файл %s.

source: Check expression <F5/F9>
ru: Проверка выражения <F5/F9>

source: Check expression
ru: Проверка выражения

source: An error was detected in the expression. Unable to determine the type of expression.
ru: Обнаружена ошибка в выражении. Невозможно определить тип выражения.

source: Expression is empty
ru: Выражение пустое

source: Expression
ru: Выражение

source: The expression in the attribute "Expr" is not a logical expression.
ru: Выражение в атрибуте "Expr" не является логическим выражением.

source: Extension
ru: Расширение

source: Extension kind
ru: Тип расширения

source: Extension name
ru: Название расширения

source: Extensions
ru: Расширения

source: Extensions module
ru: Модуль расширений

source: Extensions modules
ru: Модули расширений

source: Call function %s failed in the extension module %s. Try to find and remove the module that causes the error.
ru: Сбой вызова функции %s в модуле расширения %s. Попробуйте найти и удалить модуль, вызывающий ошибку.

source: Extensions modules (*.epas)|*.epas|
ru: Модули расширений (*.epas)|*.epas|

source: Extra list width
ru: Расширить список на

source: Failed to create database.%s
ru: Не удалось создать базу данных.%s

source: Failed to load image.
ru: Не удалось загрузить изображение.

source: Failed to save image.
ru: Не удалось сохранить изображение.

source: Failed to write data to the database. You can try again.
ru: Не удалось записать данные в базу данных. Вы можете повторить попытку.

source: Unexpected exception
ru: Неожиданное исключение

source: Oops! Sorry for the inconvenience. An unexpected exception.%sDo you want to continue running the program?
ru: Опа! Извините за неудобства. Неожиданное исключение.%sХотите продолжить выполнение программы?

source: Oops! Sorry for the inconvenience. An unexpected exception.%s
ru: Опа! Извините за неудобства. Неожиданное исключение.%s

source: Library %s was not unloaded. To work correctly, restart the application.
ru: Библиотека %s не была выгружена. Для корректной работы перезапустите приложение.

# strconsts.rsfield
source: Field
ru: Поле

source: Field can not be a parameter.
ru: Поле не может быть параметром.

source: A field can not be a parameter, because it is used in grouping by date.
ru: Поле не может быть параметром, потому что испольуется в группировке по дате.

source: Field [%s] is required.
ru: Поле [%s] является обязательным.

source: Field name
ru: Имя поля

# strconsts.rsfieldnameempty
source: Field name is empty.
ru: Не указано имя поля.

# strconsts.rsfieldnameexists
source: Field with same name already exists.
ru: Поле с таким именем уже существует.

source: Field [%s] not date.
ru: Поле [%s] не является датой.

source: Field is not a file or image: %s
ru: Поле не является файлом или изображением: %s

source: Field not found: %s
ru: Поле не найдено: %s

source: Field not found. Unable to determine field type.
ru: Поле не найдено. Невозможно определить тип поля.

source: Field is not a image: %s
ru: Поле не является изображением: %s

source: Field [%s] not is objects.
ru: Поле [%s] не является объектом.

source: Field not selected.
ru: Поле не выбрано.

source: Field properties: %s
ru: Свойства поля: %s

source: Fields
ru: Поля

source: Field type must be "Number".
ru: Тип поля должен быть "Число".

source: Field should be visible or parameter.
ru: Поле должно быть видимым или параметром.

source: Fields in the list
ru: Поля в списке

source: Field size
ru: Размер поля

source: Field size must not exceed 1000 characters.
ru: Размер поля не должен превышать 1000 символов.

source: Field size must be in range from 1 to 2000 characters.
ru: Размер поля должен быть в пределах от 1 до 2000 символов.

source: Value should be in the range from 1 to 2000.
ru: Значение должно быть в пределах от 1 до 2000.

source: Select any fields
ru: Выберите какие-нибудь поля

source: Field type
ru: Тип поля

source: Field [%s without a closing bracket ].
ru: Поле [%s без закрывающей скобки ].

# strconsts.rsfile
source: File
ru: Файл

source: File action
ru: Действие с файлом

source: File field [%s] not found.
ru: Поле файла [%s] не найдено.

source: Files %s|*.%s|All files (*.*)|*.*
ru: Файлы %s|*.%s|Все файлы (*.*)|*.*

source: Filename
ru: Имя файла

source: Enter filename
ru: Введите имя файла

source: File name too long (> 150).
ru: Имя файла слишком длинное (> 150).

source: File %s not exists.
ru: Файл %s не найден.

source: The file is not a valid Firebird database.
ru: Файл не является корректной базой данных Firebird.

source: File path too long (> 255).
ru: Путь слишком длинный (>255).

source: Fill color
ru: Цвет заливки

source: Filling
ru: Заливка

source: Fill table
ru: Заполнить таблицу

source: Fill table filter
ru: Фильтр заполнить таблицу

# strconsts.rsfilter
source: Filter
ru: Фильтр

# strconsts.rsfilterbnhint
source: Filter <F7>
ru: Фильтр <F7>

source: Filter by totals
ru: Фильтр по итогам

source: Filter name
ru: Название фильтра

source: Filter presets
ru: Предустановки фильтра

source: The first filter used by default.
ru: Первый фильтр используется по умолчанию.

source: Find
ru: Найти

source: Find actions
ru: Поиск действий

source: Find component
ru: Найти компонент

source: Find expressions
ru: Поиск выражений

source: Find field
ru: Найти поле

source: Find field or expression
ru: Найти поле или выражение

source: Find form
ru: Найти форму

source: Find in modules
ru: Поиск в модулях

source: Find in syntax-panel
ru: Найти в синтаксис-панели

source: Find lost
ru: Поиск пропавших

source: Find module
ru: Найти модуль

source: Find node
ru: Найти узел

source: Find previous
ru: Найти предыдущее

source: Find / Replace
ru: Найти / Заменить

source: Flat
ru: Плоский

source: Flat buttons
ru: Плоские кнопки

source: The value [%s] of field [%s] out of range.
ru: Значение [%s] поля [%s] вне допустимого диапазона.

source: The value [%s] out of range.
ru: Значение [%s] вне допустимого диапазона.

# strconsts.rsfmtdatemonth
source: January February March April May June July August September October November December
ru: января февраля марта апреля мая июня июля августа сентября октября ноября декабря

source: Fold all code
ru: Свернуть весь код

source: Font
ru: Шрифт

# strconsts.rsfontbold
source: B
ru: Ж

# strconsts.rsfontitalic
source: I
ru: К

source: Font name
ru: Имя шрифта

source: Font size
ru: Размер шрифта

# strconsts.rsfontstrikeout
source: S
ru: З

# strconsts.rsfontunderline
source: U
ru: Ч

source: Foot
ru: Подвал

source: For all action
ru: Действие для всех

source: Form
ru: Форма

source: Form action
ru: Действие формы

source: Form actions
ru: Действия формы

source: This form has already been selected.
ru: Эта форма уже была выбрана.

source: Format
ru: Формат

source: A form with the same component name already exists.
ru: Форма с таким именем компонента уже существует.

source: Form field
ru: Поле формы

source: Form field not selected.
ru: Поле формы не выбрано.

source: Form link to
ru: Форма ссылается на

source: Form module
ru: Модуль формы

source: Form modules (*.fpas)|*.fpas|
ru: Модули форм (*.fpas)|*.fpas|

source: Form name
ru: Имя формы

source: A form with the same name already exists.
ru: Форма с таким именем уже существует.

source: In this expression forms is not available.
ru: В этом выражении формы недоступны.

source: Form not found: %s
ru: Форма не найдена: %s

source: Form not found.
ru: Форма не найдена.

source: Form not selected.
ru: Форма не выбрана.

source: Form or query not found: %s
ru: Форма или запрос не найден: %s

source: Forms
ru: Формы

source: Forms link to selected form
ru: Формы, ссылающиеся на выбранную форму

source: Forms modules
ru: Модули форм

source: Form web module
ru: Веб-модуль формы

source: Form web modules
ru: Веб-модули форм

source: Forum
ru: Форум

source: Boolean operation expected.
ru: Ожидается логическая операция.

source: Comparsion operation expected.
ru: Ожидается операция сравнения.

source: Expression not parsed.
ru: Выражение не распознано.

source: Source field expected.
ru: Ожидается поле источника.

source: Source field name is empty.
ru: Имя поля источника пустое.

source: Source field [%s] not found.
ru: Поле источника [%s] не найдено.

source: Source field [%s] not found in [%s].
ru: Поле источника [%s] не найдено в [%s].

source: It is not valid to use the object field (component) [%s] as a source field.
ru: Недопустимо использовать поле объекта (компонент) [%s] как поле источника.

source: Frame
ru: Рамка

source: From the beginning
ru: С начала

source: From cursor
ru: От курсора

source: Full access
ru: Полный доступ
