Repository: dxbit/dataexpress
Catalog: _test/languages/*/dataexpress.*.po
Languages: ru

source: Full star
ru: Шестиугольная

source: Function not found: %s
ru: Функция не найдена: %s

source: Function [%s] not found in module [%s].
ru: Функция [%s] не найдена в модуле [%s].

source: The function cannot be applied to files and images.
ru: Функцию нельзя применить к файлам и изображениям.

# strconsts.rsfuncnotsel
source: Function not selected.
ru: Функция не выбрана.

source: The "%s" function must have a data type of number.
ru: Для функции "%s" должен быть выбран числовой тип данных.

source: Function
ru: Функция

source: Function GET
ru: Функция GET

source: Function name
ru: Имя функции

source: Functions
ru: Функции

source: Functions. Show help by function under cursor <F2>
ru: Функции. Показать справку по функции под курсором <F2>

source: Gallery
ru: Галерея

source: General view
ru: Общий вид

source: Unable to determine the number of changes to the database tables.
ru: Не удалось определить количество изменений таблиц базы данных.

source: Get value under cursor
ru: Получить значение под курсором

source: Glow
ru: Свечение

source: Glyph
ru: Значок

source: Go to
ru: Переход

source: Go to form
ru: Перейти к форме

source: Go to Help
ru: Перейти к справке

source: Go to next item
ru: Перейти к следующему элементу

source: Go to URL
ru: Перейти по ссылке

source: Grand total
ru: Общий итог

source: Graph
ru: График

source: Great
ru: Больше

source: Great or equal
ru: Больше или равно

source: Grid
ru: Сетка

source: Grid bottom
ru: Таблица внизу

source: Grid color
ru: Цвет сетки

source: Grid left
ru: Таблица слева

source: Grid lines
ru: Линии сетки

source: Grid only
ru: Только таблица

source: Grid right
ru: Таблица справа

source: Grid size X
ru: Размер X сетки

source: Grid size Y
ru: Размер Y сетки

source: Grid top
ru: Таблица вверху

source: Group
ru: Группа

source: Group by date
ru: Группировка по дате

# strconsts.rsgroupdigits
source: Group digits
ru: Группировать цифры

source: Group field
ru: Поле группы

source: Grouping type
ru: Тип группировки

source: Group name
ru: Название группы

source: You can not use characters \ and | in the group name.
ru: Нельзя использовать символы \ и | в имени группы.

source: Group name is required.
ru: Название группы обязательное.

source: Header
ru: Заголовок

source: Header color
ru: Цвет заголовка

source: Header font
ru: Шрифт заголовка

source: Header lines
ru: Линии заг.

source: Headers
ru: Заголовки

source: Header total
ru: Итог заг.

source: Height
ru: Высота

source: Help
ru: Помощь

source: Help text
ru: Справочный текст

source: Sorry, the help topic is not yet available. Try again later.
ru: Извините, раздел справки недоступен. Попробуйте еще раз позднее.

source: Hexagon
ru: Шестиугольник

source: HH
ru: ЧЧ

source: HH:MM
ru: ЧЧ:ММ

source: HH:MM:SS
ru: ЧЧ:ММ:СС

source: Hidden components
ru: Скрытые компоненты

source: Hide ancestors
ru: Скрыть предков

source: Hide base classes
ru: Скрыть базовые классы

source: Hide button
ru: Скрыть кнопку

source: Hide column
ru: Скрыть столбец

source: Hide component
ru: Скрыть компонент

source: Hide context help
ru: Скрыть контекстную справку

source: Hide list
ru: Скрыть список

source: Hide nighbour
ru: Скрыть соседа

source: Hide when lost focus
ru: Скрывать при потере фокуса

source: Hierarchy
ru: Иерархия

source: A hierarchy element can not reference its child element.
ru: Элемент иерархии не может ссылаться на свой дочерний элемент.

source: The hierarchy element can not refer to itself.
ru: Элемент иерархии не может ссылаться на самого себя.

source: Highlight current line
ru: Подсветка текущей строки

source: Hint
ru: Подсказка

source: Default folder (user temporary folder)
ru: Папка по умолчанию (временная папка пользователя)

source: Default folder (<application folder>\templates)
ru: Папка по умолчанию (<папка приложения>\templates)

source: Homepage
ru: Домашняя страница

source: Horizontal bars
ru: Линейчатая

source: Horizontal grid
ru: Горизонтальная сетка

source: Horizontal lines
ru: Горизонтальные линии

# strconsts.rshorz
source: Horizontal
ru: По горизонтали

source: Horz center
ru: По центру горизонтали

source: ID current record
ru: ID текущей записи

source: The names of functions, types and variables must not be the same.
ru: Имена функций, типов и переменных не должны совпадать.

source: Function, type, and variable names can only contain the characters A-Z, a-z, 0-9, _ and must not start with a digit.
ru: Имена функций, типов и переменных должны содержать только символы A-Z, a-z, 0-9, _ и не должны начинаться с цифры.

source: If
ru: Если

source: [if] at %d.
ru: [if] номер %d.

source: If %s
ru: Если %s

source: [ifgrid] at %d, [if] at %d.
ru: [ifgrid] номер %d, [if] номер %d.

source: Ignore
ru: Игнорировать

source: A null is detected. Verify that all operands of the logical expression have a specific values (not empty). To ensure a certain value, use function NZ or an additional null check. See also function NULL.
ru: Обнаружено значение null. Проверьте, чтобы все операнды логического выражения имели определенное значение (не пустые). Для обеспечения определенного значения используйте функцию NZ или дополнительную проверку на null. Смотрите также функцию NULL.

source: The type of the result of evaluating a logical expression is not a logical type (true or false).
ru: Тип результата вычисления логического выражения не является логическим типом (истина или ложь).

source: I know what I do
ru: Я знаю, что делаю

source: Illegal boolean operation.
ru: Недопустимая логическая операция.

source: Illegal date/time operation.
ru: Недопустимая операция с датой / временем.

source: Illegal numeric operation.
ru: Недопустимая операция с числами.

source: Illegal string operation.
ru: Недопустимая операция с текстом.

source: Image
ru: Изображение

source: The image with same name already exists.
ru: Изображение с таким именем уже существует.

source: Image field [%s] not found.
ru: Поле изображения [%s] не найдено.

source: Image properties
ru: Свойства изображения

source: Old name: %0:s New name: %1:s
ru: Прежнее имя: %0:s Новое имя: %1:s

source: Images
ru: Изображения

source: Image used in actions:
ru: Изображение используется в действиях:

source: Image used in components:
ru: Изображение используется в компонентах:

source: Processing when printing
ru: Обработка при печати

source: Incorrect check: %s
ru: Некорректный флажок: %s

source: Incorrect counter value: %s
ru: Некорректное значение счетчика: %s

source: Incorrect date: %s
ru: Некорректная дата: %s

source: Incorrect number: %s
ru: Некорректное число: %s

source: Incorrect time: %s
ru: Некорректное время: %s

source: We could not find any matching fields in the database. Make sure that the field names in the first line are correct and that the file's encoding is correct.
ru: Не удалось найти ни одного совпадающего поля в базе данных. Убедитесь, что кодировка файла и имена полей в первой строке корректные.

source: Do you want to import anyway?
ru: Вы все равно хотите импортировать?

source: During the verification of the input data, the following errors were found:
ru: В ходе проверки данных были обнаружены следующие ошибки:

source: Import data
ru: Импорт данных

source: Row %d: %s
ru: Строка %d: %s

source: CSV files (*.csv)|*.csv|All files (*.*)|*.*
ru: Файлы CSV (*.csv)|*.csv|Все файлы (*.*)|*.*

source: DataExpress Project (*.dxp)|*.dxp|All files (*.*)|*.*
ru: Проект DataExpress (*.dxp)|*.dxp|Все файлы (*.*)|*.*

source: The following fields are not found in the database: %s. Make sure the field names are correct.
ru: Следующие поля не были найдены в базе данных: %s. Убедитесь, что имена полей указаны верно.

source: Import module
ru: Импорт модуля

source: Import modules
ru: Импорт модулей

source: Import of project was successfull.
ru: Импорт проекта успешно завершен.

source: Import Project
ru: Импорт проекта

source: An error occured when importing project.
ru: При импорте проекта произошла ошибка.

source: %d records were imported sucessfully.
ru: %d записей импортировано успешно.

source: The following fields found have an unsupported field type: %s.
ru: Следующие найденные поля имеют неподдерживаемый тип поля: %s.

source: Inactive selected
ru: Неактивное выделение

source: Inactive selected text
ru: Текст неактив. выделения

source: Include in search
ru: Включить в поиск

source: Incoming
ru: Приход

source: Incompatible argument #%d of function %s. Got %s expected %s.
ru: Несовместимый аргумент № %d функции %s. Получено %s, ожидается %s.

source: Incompatible fields.
ru: Несовместимые поля.

source: Incompatible types.
ru: Несовместимые типы.

source: The result of the expression is not compatible with the source field. Got %s, expected %s.
ru: Результат выражения не совместим с полем источника. Получено %s, ожидается %s.

source: The result of evaluating the expression is incompatible with the field. For example, you can not write text into a numeric field.
ru: Результат вычисления выражения несовместим с полем. Например, нельзя записать текст в числовое поле.

source: Incorrect access
ru: Некорректные права доступа

source: Indent
ru: Отступ

source: Indication
ru: Индикация

source: Indicator
ru: Индикатор

source: Information
ru: Информация

source: Cannot initialize fields.
ru: Не удалось инициализировать поля.

source: Inner length
ru: Длина внутренняя

source: Input
ru: Вводить

source: In selected
ru: В выделенном

# strconsts.rsinsert
source: Insert
ru: Вставить

source: Insert action...
ru: Вставить действие...

source: Insert event handler
ru: Вставить обработчик события

source: Insert form field
ru: Вставить поле формы

source: INS
ru: ВСТ

source: Insert...
ru: Вставить...

source: Insert query field
ru: Вставить поле запроса

source: Insert source field
ru: Вставить поле источника

source: Insert total function
ru: Вставить итоговую функцию

source: Insert values
ru: Вставить значения

source: Inside
ru: Внутри

source: Interface
ru: Интерфейс

source: Interfaces
ru: Интерфейсы

source: Intervals
ru: Интервалы

source: You can not use the following characters in the names of fields: ' " | ! < > [ ] { } / =
ru: Нельзя использовать в именах полей следующие символы: ' " | ! < > [ ] { } / =

source: You can not use the following characters in the names of forms, queries and reports: ' " | ! < > [ ] { } / \ ? : *
ru: Нельзя использовать в именах форм, запросов и отчетов следующие символы: ' " | ! < > [ ] { } / \ ? : *

# strconsts.rsinvalidcharinimagename
source: You can not use the following characters in the names of images: \ / : * ? " < > |
ru: Нельзя использовать в именах изображений следующие символы: \ / : * ? " < > |

# strconsts.rsinvalidcharinmodulename
source: You can not use the following characters in the names of modules: \ / : * ? " < > |
ru: Нельзя использовать в именах модулей следующие символы: \ / : * ? " < > |

source: Invalid component name.
ru: Неверное имя компонента.

source: Invalid comparison operation.
ru: Недопустимая операция сравнения.

source: Invalid date %s
ru: Некорректная дата %s

source: Invalid method call child form: %s
ru: Недопустимый вызов метода подчиненной формы: %s

source: Invalid number: %s
ru: Некорректное число: %s

# strconsts.rsinvalidnumberargsfunc
source: Invalid number arguments of function %s. Got %d expected %d.
ru: Неверное количество аргументов функции %s. Получено %d, ожидается %d.

source: Operation %s is not valid for %s type.
ru: Операция %s недопустима для типа %s.

source: Operation %s is not valid for %s type. Expected %s.
ru: Операция %s недопустима для типа %s. Ожидается %s.

source: Invalid range.
ru: Недопустимый диапазон.

source: Invalid username or password.
ru: Неверное имя пользователя или пароль.

source: Tags {form|%s} and {form|%s} are in the same paragraph. Using more than one tag "form" in the same paragraph is invalid.
ru: Теги {form|%s} и {form|%s} находятся в одном абзаце. Использование более одного тега "form" в том же абзаце недопустимо.

source: Tags {grid|%s} and {grid|%s} are in the same table row. Using more than one tag "grid" in the same table row is invalid.
ru: Теги {grid|%s} и {grid|%s} находятся в одной строке таблицы. Использование более одного тега "grid" в той же строке таблицы недопустимо.

source: Using more than one tag "group" in the same paragraph or the same row of the table is invalid.
ru: Использование более одного тега "group" в том же абзаце или той же строке таблицы недопустимо.

source: IP address
ru: IP адрес

source: Italic <Ctrl-I>
ru: Наклонный <Ctrl-I>

source: Key field
ru: Ключевое поле

source: Key field not selected.
ru: Ключевое поле не выбрано.

source: Label
ru: Надпись

source: The label can not be empty or filled with spaces.
ru: Надпись не может быть пустой или заполнена пробелами

source: Language
ru: Язык

source: The last time there was a critical error. Continue database connection?
ru: В прошлый раз произошла критическая ошибка. Продолжить подключение к базе данных?

source: Layout
ru: Расположение

# strconsts.rslayoutbottom
source: Bottom
ru: Внизу

# strconsts.rslayouttop
source: Top
ru: Вверху

source: Label text
ru: Текст

source: Left
ru: Слева

source: Left justify
ru: По левому краю

source: Left side
ru: Левая сторона

source: Legend
ru: Легенда

source: Length
ru: Длина

source: Less
ru: Меньше

source: Less or equal
ru: Меньше или равно

source: Level count
ru: Количество уровней

source: License agreement
ru: Лицензионное соглашение

source: Licensed under the Apache License, Version 2.0
ru: Лицензировано по лицензии Apache, версия 2.0

source: The total size of the fields on the form [%s] exceeds 65535 bytes and is %d bytes. The total size of the fields should be reduced by %d bytes (%n chars). To do this, reduce the size of text fields or delete unnecessary fields.
ru: Общий размер полей в форме [%s] превышает 65535 байт и составляет %d байт. Общий размер полей должен быть уменьшен на %d байт (%n символов). Для этого уменьшите размер текстовых полей или удалите лишние поля.

source: The total size of the fields, with the objects and object fields, on the form [%s] exceeds 65535 bytes and is %d bytes. The total size of the fields should be reduced by %d bytes (%n chars). To do this, delete some fields of objects, reduce the size of fields associated with objects or fields of objects, reduce the size of form fields.
ru: Общий размер полей, с учетом объектов и полей объектов, в форме [%s] превышает 65535 байт и составляет %d байт. Общий размер полей должен быть уменьшен на %d байт (%n символов). Для этого удалите некоторые поля объектов, уменьшите размер полей, связанных с объектами и полями объектов, уменьшите размер полей формы.

source: The total size of the fields on the form [%s] exceeds 65535 bytes and is %d bytes. The total size of the fields should be reduced by %d bytes (%n chars). To do this, delete the newly added or unnecessary fields. Reducing the size of text fields in this case does not help.
ru: Общий размер полей в форме [%s] превышает 65535 байт и составляет %d байт. Общий размер полей должен быть уменьшен на %d байт (%n символов). Для этого удалите только что добавленные или ненужные поля. Уменьшение размера текстовых полей в данном случае не поможет.

source: Limited access
ru: Ограниченный доступ

source: Line
ru: Линия

source: Line color
ru: Цвет линии

source: Single line comment
ru: Комментарии в одну строку

source: Lines
ru: Линии

source: %d lines
ru: %d строк

source: Line style
ru: Стиль линии

source: Line width
ru: Ширина линии

source: Linked object
ru: Связанный объект

source: Link lines
ru: Линия связи

source: Link setup
ru: Настройка связи

source: Link to form
ru: Связь с формой

source: List
ru: Список

source: Specify at least one field in the list.
ru: Укажите хотя бы одно поле в списке.

source: List filter
ru: Фильтр списка

source: List Source
ru: Источник списка

source: Click the "More" button to see the list source.
ru: Нажмите кнопку "Дополнительно", чтобы увидеть источник списка.

source: The list source is not configured correctly.
ru: Источник списка настроен некорректно.

source: Could not load script code.%sError message: %sModule name: %sModule kind: %s
ru: Не удалось загрузить код скрипта.%sСообщение об ошибке: %sМодуль: %sТип модуля: %s

source: Load file
ru: Загрузить файл

source: Load image
ru: Загрузить изображение

source: Could not load the image from the extension module. Make sure the image is valid format. Error message: %s
ru: Не удалось загрузить изображение из модуля расширения. Убедитесь, что изображение в правильном формате. Сообщение об ошибке: %s

source: Loading...
ru: Загрузка...

source: Loading data...
ru: Загрузка данных...

source: Logical AND
ru: Логическое И

source: Logical expression
ru: Логическое выражение

source: Logical OR
ru: Логическое ИЛИ

source: Login time
ru: Время входа

source: Look
ru: Посмотреть

source: %s (calc field %s)
ru: %s (вычисляемое поле %s)

source: Loop detected in the calculation chain: %s
ru: Обнаружено зацикливание в цепочке вычислений: %s

source: Loop detected in calculations.
ru: Обнаружено зацикливание в вычислениях.

source: %s (output filter)
ru: %s (выходной фильтр)

source: %s (source filter %d)
ru: %s (фильтр источника %d)

source: %s (SQL expression)
ru: %s (SQL выражение)

source: Found a circular dependency between queries: %s
ru: Обнаружена циклическая зависимость между запросами: %s

source: MAC address
ru: MAC адрес

source: Manual refresh
ru: Обновлять вручную

source: Margin
ru: Отступ

source: Margin bottom
ru: Нижнее

source: Margin left
ru: Левое

source: Margin right
ru: Правое

source: Margins
ru: Поля

source: Margins external
ru: Поля внешние

source: Margins left/right
ru: Поля слева/справа

source: Margins top/bottom
ru: Поля сверху/снизу

source: Margin top
ru: Верхнее

source: Mark
ru: Подпись

source: Mark and value
ru: Подпись и значение

source: Marks
ru: Подписи

source: Marks of data
ru: Подписи данных

source: The entered value does not match the mask
ru: Введенное значение не соответствует маске

source: Mass calculation
ru: Массовые вычисления

source: Max height
ru: Растянуть

source: Maximize editor <F12>
ru: Максимизировать редактор <F12>

source: Maximum
ru: Максимум

source: Max length
ru: Макс. длина

source: Max width
ru: Расширить

source: Memo
ru: Заметка

source: Menu
ru: Меню

source: Merge
ru: Соединить

source: Merge All
ru: Соединить все

source: Some components will be renamed because the project already have such names.
ru: Некоторые компоненты будут переименованы, т. к. в проекте уже есть такие имена.

source: Merge projects was successfull.
ru: Объединение проектов успешно завершено.

source: Some components have been renamed because the project already have such names.
ru: Некоторые компоненты были переименованы, т. к. в проекте уже есть такие имена.

source: Merge projects
ru: Объединение проектов

source: An error occured when merging projects.
ru: При объединении проектов произошла ошибка.

source: Message
ru: Сообщение

source: Min height
ru: Сжать

source: Minimum
ru: Минимум

source: Min length
ru: Мин. длина

source: Min width
ru: Сузить

source: Modified
ru: Изменен

source: (modified)
ru: (изменено)

source: Module
ru: Модуль

source: The module named "%s" already exists.
ru: Модуль с именем "%s" уже существует.

source: Module name
ru: Имя модуля

source: Module name "%s" is reserved.
ru: Название модуля "%s" зарезервировано.

source: Modules "%s" and "%s" contain the same features.
ru: Модули "%s" и "%s" содержат одинаковые возможности.

source: Module "WebMain" already exists.
ru: Модуль "WebMain" уже существует.

# strconsts.rsmonthnames
source: January February March April May June July August September October November December
ru: Январь Февраль Март Апрель Май Июнь Июль Август Сентябрь Октябрь Ноябрь Декабрь

source: Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec
ru: Янв Фев Мар Апр Май Июн Июл Авг Сен Окт Ноя Дек

source: More properties
ru: Еще свойства

source: Move
ru: Переместить

source: Move down
ru: Вниз

source: Move first
ru: Первая запись

source: Move last
ru: Последняя запись

source: Move left
ru: Переместить влево

source: Move next
ru: Следующая запись

source: Move previous
ru: Предыдущая запись

source: Move right
ru: Переместить вправо

source: Move up
ru: Вверх

source: Move when scroll
ru: Перемещение при прокрутке

source: Message type
ru: Тип сообщения

source: Message when an update is found
ru: Сообщение при обнаружении обновления

source: Multiline comment
ru: Комментарии в несколько строк

source: Multiline labels not allow.
ru: Многострочные надписи не допускаются.

source: Multiple records caption
ru: Заголовок множества записей

source: Multiplication
ru: Умножение

source: My action or MyFunction
ru: Мое действие или MyFunction

source: My group/My subgroup
ru: Моя группа/Моя погруппа

source: Name
ru: Имя

source: [%s] not found in help index.
ru: [%s] не найден в указателе справки.

source: New
ru: Новая

source: The database was created in a newer version of the program. Some features may not be available or work incorrectly. It is recommended to update the program to the latest version.
ru: База данных была создана в более новой версии программы. Некоторые возможности могут быть недоступны или работать некорректно. Рекомендуется обновить программу до последней версии.

source: The selected language will be applied after the application is restarted.
ru: Выбранный язык будет применен после перезапуска приложения.

source: New line <Ctrl-Space>
ru: Новая строка <Ctrl-Пробел>

source: New module
ru: Новый модуль

source: %s (New record)
ru: %s (Новая запись)

source: New report
ru: Новый отчет

source: New section
ru: Новый раздел

source: The selected language or theme will be applied after the application is restarted.
ru: Выбранный язык или тема будут применены после перезапуска приложения.

# strconsts.rsnext
source: Next
ru: Далее

# strconsts.rsno
source: No
ru: Нет

source: No access
ru: Нет доступа

source: No action
ru: Нет действия

source: No context help for this element.
ru: Нет контекстной справки для этого элемента.

source: No data source is specified.
ru: Не указан источник данных.

source: No data to import. The file is empty.
ru: Нет данных для импорта. Файл пуст.

source: No forms available.
ru: Нет доступных форм.

source: None
ru: Нет

source: Not
ru: Не

source: Not all fields are selected.
ru: Не все поля выбраны.

source: Not available for child form.
ru: Не доступно для дочерних форм.

source: Not contained in the list
ru: Не содержится в списке

source: Not containing text
ru: Не содержит текст

source: Not equal
ru: Не равно

source: Nothing
ru: Нет

source: Nothing found
ru: Ничего не найдено

source: No thumbnail
ru: Нет миниатюры

source: On a note. In order not to lose the done changes, make the project export (menu Tools - Project Export). After successfully connecting to the database, import the project (Tools - Import Project) to restore the changes made.
ru: На заметку. Чтобы не потерять проделанные изменения, сделайте экспорт проекта (меню Сервис - Экспорт проекта). После успешного подключения к базе данных, импортируйте проект (Сервис - Импорт проекта) для восстановления проделанных изменений.

source: No to all
ru: Нет для всех

source: Field is not object
ru: Поле не является объектом

source: No visible fields
ru: Нет видимых полей

source: Current date
ru: Текущая дата

source: Null
ru: Пусто

source: Null to 0
ru: Null в 0

source: Number
ru: Число

source: Number of digits after the decimal point
ru: Количество знаков после запятой

source: Number or Text
ru: Число или Текст

source: Number out of range: %s
ru: Число за пределами диапазона: %s

# strconsts.rsobject
source: Object
ru: Объект

source: Select <Shift-Enter>
ru: Выбрать <Shift-Enter>

source: Object field not found: %s
ru: Поле объекта не найдено: %s
