Repository: dxbit/dataexpress
Catalog: _test/languages/*/dataexpress.*.po
Languages: ru

source: Object field not selected
ru: Поле объекта не выбрано

source: Object fields
ru: Поля объекта

source: Object in form
ru: Объект на форме

source: An object must be selected for this data source.
ru: Для этого источника данных требуется объект

source: The object [%s] does not have an linked form.
ru: Объект [%s] не имеет связанной формы.

source: Object not selected.
ru: Объект не выбран.

source: Object field
ru: Поле объекта

source: You cannot use the field of object [%s].
ru: Нелья использовать поле объекта [%s].

source: Offset X
ru: Смещение X

source: Offset Y
ru: Смещение Y

# strconsts.rsok
source: OK
ru: ОК

source: Old module
ru: Старый модуль

source: One record caption
ru: Заголовок одной записи

source: Only the developer can enter the designer.
ru: Только разработчик может войти в дизайнер.

source: Only editing
ru: Только редактирование

source: Only values from the list
ru: Только значения из списка

source: Only viewing
ru: Только просмотр

source: OpenOffice Document
ru: Документ OpenOffice

source: OpenOffice Spreadsheet
ru: Электронная таблица OpenOffice

# strconsts.rsopen
source: Open
ru: Открыть

source: Open connection list
ru: Открыть список подключений

source: Open database
ru: Открыть базу данных

# strconsts.rsopendb
source: Open
ru: Открыть

source: Open demo database
ru: Открыть демо-базу

source: Open file
ru: Открыть

source: Open file location
ru: Открыть расположение файла

source: Open homepage
ru: Открыть домашнюю страницу

source: Open the last database
ru: Открыть последнюю базу данных

source: All pictures (*.bmp, *.gif, *.ico, *.jpg, *.jpeg, *.jfif, *.png, *.tif, *.xpm)|*.bmp;*.gif;*.ico;*.jpg;*.jpeg;*.jfif;*.png;*.tif;*.xpm
ru: Все изображения (*.bmp, *.gif, *.ico, *.jpg, *.jpeg, *.jfif, *.png, *.tif, *.xpm)|*.bmp;*.gif;*.ico;*.jpg;*.jpeg;*.jfif;*.png;*.tif;*.xpm

source: Open report
ru: Открыть отчет

source: Open template with
ru: Открыть шаблон в

source: Open template
ru: Открыть шаблон

source: Open templates folder
ru: Открыть папку шаблонов

source: Open with application
ru: Открыть в приложении

source: Operand expected.
ru: Ожидается операнд.

source: Operation %s is not valid for operands of different types: %s and %s. Operands must be of the same type.
ru: Операция %s недопустима для операндов разных типов: %s и %s. Операнды должны быть одного типа.

source: Options
ru: Опции

source: Ordered list
ru: Нумерованный список

source: Order and visibility of columns
ru: Порядок и видимость столбцов

source: The order and visibility of forms in tabs
ru: Порядок и видимость форм в закладках

source: or Expression
ru: или Выражение

source: Orientation
ru: Поворот

source: Original size
ru: Оригинальный размер

source: Other
ru: Прочее

source: Outcoming
ru: Расход

source: Output
ru: Вывод

source: Output filter
ru: Выходной фильтр

source: Output folder
ru: Папка вывода

# strconsts.rsoutside
source: Outside
ru: Снаружи

source: Overlap policy
ru: Политика перекрытия

source: Pad fractional part with zeros
ru: Дополнять нулями дробную часть

source: Page
ru: Закладка

source: Pages
ru: Закладки

source: Jackdaws love my big sphinx of quartz.
ru: Мюзикл-буфф "Огнедышащий простужается ночью" (в 12345 сценах и 67890 эпизодах).

source: The quick brown fox jumps over the lazy dog 1234567890 times.
ru: Бегом марш! У месторождения кварцующихся фей без слёз хочется электрическую пыль.

source: Pack my box with five dozen liquor jugs.
ru: Всё ускоряющаяся эволюция компьютерных технологий предъявила жёсткие требования к производителям как собственно вычислительной техники, так и периферийных устройств.

source: Parameter
ru: Параметр

source: Report parameter with same name already exists.
ru: Параметр отчета с таким именем уже существует.

source: Parameter [%s] is required.
ru: Параметр [%s] является обязательным для заполнения.

source: Parent field
ru: Поле предка

source: -- Parent form --
ru: -- Родительская форма --

source: During the analysis modules extensions detected errors:%sSome actions and functions may not be found. To find the errors, open Script Editor and run the compilation.
ru: В процессе анализа модулей расширений были найдены ошибки:%sНекоторые действия и функции могут не работать. Чтобы найти ошибки, откройте редактор скриптов и выполните компиляцию.

source: Pascal Script reference
ru: Справочник Pascal Script

source: Passport ID
ru: Номер паспорта

source: Passport series
ru: Серия паспорта

source: Password
ru: Пароль

source: Paste
ru: Вставить

source: Paste cells
ru: Вставить ячейки

source: Paste extension template
ru: Вставить шаблон расширения

source: Paste from script
ru: Вставить из скрипта

source: Paste GUID
ru: Вставить GUID

source: Paste image as base64
ru: Вставить изображение как base64

source: An error occurred while pasting image: %s
ru: При вставке изображения возникла ошибка: %s

source: Paste special
ru: Специальная вставка

source: Paused
ru: Пауза

source: Period
ru: Период

# strconsts.rsperiodfrom
source: from
ru: с

# strconsts.rsperiodto
source: to
ru: по

source: Phone number
ru: Номер телефона

source: Pick from list window
ru: Выбрать из окна списка

source: Pick up
ru: Подбор

source: Quickly adding fields to selection
ru: Быстрое добавление полей в отбор

source: Pie
ru: Круговая

source: Pivot grid not found: %s
ru: Сводная таблица не найдена: %s

source: Pivot table
ru: Сводная таблица

source: PNG files (*.png)|*.png
ru: Файлы PNG (*.png)|*.png

source: Point
ru: Точка

source: Points
ru: Точки

source: Position
ru: Положение

source: Precision must not exceed 10 digits.
ru: Точность не должна превышать 10 цифр.

source: Precission
ru: Точность

source: Preparing to work...
ru: Подготовка к работе...

source: Preview <F9>
ru: Предварительный просмотр <F9>

source: Previous
ru: Назад

source: Price
ru: Цена

source: Price field not selected.
ru: Поле цены не выбрано.

source: Print
ru: Печать

source: Print aborted.
ru: Печать прервана.

source: Print chart
ru: Печать диаграммы

source: Print errors
ru: Ошибки печати

source: Field with same name already exists in calculations when printing.
ru: Поле с таким именем уже существует в вычислениях при печати.

source: Printout
ru: Вывод на печать

source: An error occurred during printing.
ru: В процессе печати возникла ошибка.

source: To program this feature to work, you need to enter and exit the designer.
ru: Чтобы эта функция заработала, надо войти и выйти из дизайнера.

# strconsts.rsprocessing
source: Processing...
ru: Обработка...

source: Programming in DX
ru: Программирование в DX

source: Prompt before filling
ru: Запрашивать перед заполнением

source: Do you want to fill the table?
ru: Вы хотите заполнить таблицу?

source: Properties
ru: Свойства

source: Property
ru: Свойство

source: Password SYSDBA
ru: Пароль SYSDBA

source: Quantity field not selected.
ru: Поле количества не выбрано.

source: Quantity
ru: Количество

source: Queries
ru: Запросы

source: Query
ru: Запрос

source: Query field
ru: Поле запроса

# strconsts.rsqueryfieldnameexists
source: A field with the same name already exists.
ru: Поле с таким именем уже существует.

source: Query field not selected.
ru: Поле запроса не выбрано.

source: Query grid
ru: Таблица

source: Query name
ru: Имя запроса

source: Query not found: %s
ru: Запрос не найден: %s

source: Range
ru: Диапазон

# strconsts.rsrangefrom
source: from
ru: от

source: [%s] should be in the range from %s to %s.
ru: [%s] должно быть в пределах от %s до %s.

source: Value should be in the range from %s to %s.
ru: Значение должно быть в пределах от %s до %s.

# strconsts.rsrangeto
source: to
ru: до

source: The metadata of the forms was read with errors or unrecognized. Some features of the database may not work or work incorrectly. Maybe the database was created in a newer version of the application. Please make sure you are using the latest version of DateExpress.%s
ru: Метаданные форм были прочитаны с ошибками или нераспознаны. Некоторые возможности базы данных могут не работать или работать неправильно. Возможно база данных была создана в более новой версии приложения. Пожалуйста, убедитесь, что вы используете последнюю версию DataExpress.%s

source: Read-only
ru: Только чтение

source: Recalculate
ru: Пересчитать

source: An error occured when recalculating.
ru: При пересчете произошла ошибка.

source: Record changes detected. Refresh data?
ru: Обнаружены изменения в записи. Обновить данные?

source: This record is already being edited by another user.
ru: Эта запись редактируется другим пользователем.

source: This record is already being edited by the user "%s". The record will be opened in view mode.
ru: Эта запись уже редактируется пользователем "%s". Запись будет открыта в режиме просмотра.

source: Recents
ru: Недавние

source: Record has been deleted.
ru: Запись была удалена.

source: Record has been deleted. Refresh data?
ru: Запись была удалена. Обновить данные?

source: Record ID
ru: ID записи

source: records
ru: записей

source: Total record size exceeded 65535 bytes. Reduce the size of text fields, including in linked forms, or remove unnecessary fields.
ru: Общий размер записи превышает 65535 байт. Уменьшите размер текстовых полей, включая связанные формы, или удалите ненужные поля.

source: Rectangle
ru: Прямоугольник

source: Redo
ru: Вернуть

source: Reduce to
ru: Уменьшать до

# strconsts.rsreference
source: Reference
ru: Справочник

source: Refresh
ru: Обновить

source: Refresh the tree every time the window is shown
ru: Обновлять дерево каждый раз при показе окна

source: Refresh the tree only at the first show window
ru: Обновить дерево только при первом показе окна

source: Remove from group
ru: Убрать из группы

source: Rename
ru: Переименовать

source: When added, some images were renamed due to the following possible reasons: the name already exists, the name is longer than 50 characters, or contains invalid characters.
ru: При добавлении некоторые изображения были переименованы из-за следующих возможных причин: такие имя уже существует, длина имени превышает 50 символов или содержит недопустимые символы.

source: Rename group
ru: Переименовать группу

source: Rename image
ru: Переименовать изображение

source: Rename module
ru: Переименовать модуль

source: Rename report
ru: Переименовать отчет

source: Rename section
ru: Переименовать раздел

source: Replace
ru: Заменить

source: Do you want to replace the action?
ru: Вы хотите заменить действие?

source: Replace All
ru: Заменить все

source: Do you really want to replace all?
ru: Вы точно хотите заменить все?

source: Replaced by
ru: Заменить на

source: Do you want to replace an old module with a new module?
ru: Вы хотите заменить старый модуль на новый модуль?

source: REPL
ru: ЗАМ

source: Report
ru: Отчет

source: Component of report window with same field name already exists.
ru: Компонент окна отчета с таким именем поля уже существует.

source: Report export
ru: Экспорт отчета

source: Filename (optional)
ru: Имя файла (необязательно)

source: Report name
ru: Имя отчета

source: A report or query with the same name already exists.
ru: Отчет или запрос с таким именем уже существует.

source: Report not found: %s
ru: Отчет не найден: %s

source: Report not selected
ru: Отчет не выбран

source: Report refers to
ru: Отчет ссылается на

source: Reports
ru: Отчеты

source: Reports that link to selected form
ru: Отчеты, ссылающиеся на выбранную форму

source: Report window
ru: Окно отчета

source: Required
ru: Обязательное

source: Reset
ru: Сброс

source: Are you sure you want to reset the font settings?
ru: Вы точно хотие сбросить настройки шрифта?

source: Reset font to default
ru: Сбросить шрифт в значение по умолчанию

source: Reset settings
ru: Сбросить настройки

source: Reset all grid settings?
ru: Сбросить все настройки таблицы?

# strconsts.rsresizefieldserror
source: Unable to resize fields.%sResize following fields has been canceled:%s
ru: Не удалось изменить размер полей.%sИзменение размера следующих полей было отменено:%s

source: Restore default color
ru: Восстановить цвет по умолчанию

source: Retry
ru: Повторить

source: Return to previous item <Backspace>
ru: Вернуться к предыдущему элементу <Backspace>

source: Right
ru: Справа

source: Right justify
ru: По правому краю

source: Right side
ru: Правая сторона

source: Role
ru: Роль

source: Role not selected.
ru: Роль не выбрана.

source: Roles
ru: Роли

source: This role used by user %s
ru: Эта роль используется пользователем %s

source: Rotate labels
ru: Поворачивать подписи

source: Round rectangle
ru: Круглые углы

source: Round side
ru: Круглые стороны

source: Number of visible lines in the list
ru: Видимых строк в списке

source: Row height
ru: Высота строки

source: Row %d, Col %s:
ru: Строка %d Столбец %s:

source: Row Num
ru: № строки

source: Rows
ru: Строки

source: Row select
ru: Выделять строку

source: Report parameters have been changed. Need to refresh the report. Continue?
ru: Параметры отчета были изменены. Необходимо обновить отчет. Продолжить?

source: Running
ru: Выполнение

source: Sample masks
ru: Примеры масок

source: Save
ru: Сохранить

source: Save changes
ru: Сохранить изменения

source: The database structure was changed. Save changes before import project.
ru: Структура базы данных была изменена. Сохраните изменения перед импортом проекта.

source: The database structure was changed. Save changes and continue testing?
ru: Структура базы данных была изменена. Сохранить изменения и продолжить тестирование?

source: Save changes <Ctrl-Enter>
ru: Сохранить изменения <Ctrl-Enter>

source: An error occured when saving database settings.
ru: При сохранении настроек базы данных возникла ошибка.

source: Save file
ru: Сохранить файл

source: Now the form metadata will be saved again.
ru: Сейчас метаданные форм будут сохранены еще раз.

source: Failed to save forms.
ru: Не удалось сохранить формы.

source: Forms metadata saved successfully.
ru: Метаданные форм сохранены успешно.

source: Save image
ru: Сохранить изображение

source: Save literal characters
ru: Сохранять литералы

source: An error occured when saving modules.
ru: При сохранении модулей произошла ошибка.

source: All pictures (*.bmp, *.jpg, *.png, *.tif)|*.bmp;*.jpg;*.png;*.tif
ru: Все изображения (*.bmp, *.jpg, *.png, *.tif)|*.bmp;*.jpg;*.png;*.tif

source: Save project
ru: Сохранить проект

# strconsts.rssaveprojecterror
source: Failed to save project.
ru: Не удалось сохранить проект.

source: Saving the project is prohibited!
ru: Сохранение проекта запрещено!

source: You must first save the record. Continue?
ru: Сначала Вы должны сохранить запись. Продолжить?

source: Save record
ru: Сохранить запись

source: Save record before print
ru: Сохранить запись перед печатью

source: An error occured when saving reports.
ru: При сохранении отчетов произошла ошибка.

source: Save size
ru: Сохранять размер

source: Save to file
ru: Сохранить в файл

source: Save to output folder
ru: Сохранить в папке вывода

source: An error occured when saving users.
ru: При сохранении пользователей произошла ошибка.

source: Save your changes before exiting?
ru: Сохранить изменения перед выходом?

source: Script
ru: Скрипт

source: Script Editor
ru: Редактор скриптов

source: Script Editor <F4>
ru: Редактор скриптов <F4>

source: Script error
ru: Ошибка в скрипте

source: %sException class: %sModule name: %sModule kind: %sProcedure name: %s
ru: %sКласс исключения: %sМодуль: %sТип модуля: %sПроцедура: %s

source: An error occurred while executing the script.%s
ru: Во время выполнения скрипта произошла ошибка.%s

source: Search
ru: Поиск

source: Search all fields
ru: Искать во всех полях

source: Search area
ru: Область поиска

source: Search <F3>
ru: Поиск <F3>

source: Searched text
ru: Искомый текст

source: Search in IF
ru: Искать в ЕСЛИ

source: Search options
ru: Опции поиска

source: Search result
ru: Результат поиска

source: Search settings
ru: Настройки поиска

source: Search text
ru: Искать текст

source: Search text "%s" was not found.
ru: Искомый текст "%s" не найден

source: Section
ru: Раздел

source: Selection condition
ru: Условие отбора

source: Select
ru: Выбрать

source: Select action
ru: Выберите действие

source: Select all
ru: Выбрать все

source: Select application
ru: Выбрать приложение

source: Select color
ru: Выбрать цвет

source: Select components
ru: Выделить компоненты

source: Selected
ru: Выделение

source: Selected color
ru: Цвет выделения

source: Components: %d
ru: Компоненты: %d

source: Selected field
ru: Выбранное поле

source: Selected text
ru: Выделенный текст

source: Select embedded images
ru: Выберите встроенные изображения

source: Hold down Ctrl to select multiple images
ru: Удерживайте Ctrl, чтобы выбрать несколько изображений

source: Select fields
ru: Выбрать поля

# strconsts.rsselectfieldtype
source: Select field type
ru: Выберите тип поля

source: Select file
ru: Выбрать файл

source: Select form
ru: Выбор формы

source: Select form field
ru: Выберите поле формы

source: Select from gallery
ru: Выбрать из галереи

# strconsts.rsselection
source: Selection
ru: Отбор

source: Selection settings
ru: Настройка отбора

source: Select language
ru: Выберите язык

source: Select query
ru: Выбор запроса

source: Select query field
ru: Выберите поле запроса

source: Select report
ru: Выбрать отчет

source: Select source field
ru: Выберите поле источника

source: Select type
ru: Выберите тип

source: Send to back
ru: Вниз

source: Sent to printer
ru: Отправить на принтер

source: Series
ru: Ряды

source: Series %d
ru: Ряд %d

source: Set current form
ru: Установить текущую форму

source: Settings
ru: Настройки

source: Set to zero
ru: Обнулить

source: Set value
ru: Установить значение

source: *Set width to 0 for auto width
ru: *Установите ширину в 0 для автоматического подбора ширины

source: Shadow
ru: Тень

source: Shape
ru: Фигура

source: Shape type
ru: Тип фигуры

source: Shopping
ru: Шопинг

source: Show button
ru: Показать кнопку

source: Show buttons
ru: Показать кнопки

source: Show column total
ru: Показать столбец итогов

source: Show grand total
ru: Показывать общий итог

source: Show grid
ru: Показывать сетку

source: Show help <F1>
ru: Показать справку <F1>

source: Show hints
ru: Показывать подсказки

source: Show message
ru: Показать сообщение

source: The message shows the old name of the field before renaming, which is still stored in the related actions.
ru: В сообщение показано старое имя поля до переименования, которое все еще сохраняется в связанных действиях.

source: Show only the first
ru: Показать только первые

source: Show row delete button (web)
ru: Кнопка удаления строки (веб)

source: Show row total
ru: Показать строку итогов

source: Show scroll bars
ru: Показывать полосы прокрутки

source: Show subtotal
ru: Показать промежуточный итог

source: Show thumbnail only
ru: Показывать только миниатюру

source: Shrink/stretch
ru: Сжать/растянуть

source: Side by side
ru: Рядом

source: Simple form
ru: Простая форма

source: Simple form [%s] cannot be a data source, because it does not store data.
ru: Простая форма [%s] не может быть источником данных, т. к. не хранит данные.

source: Single
ru: Монопольный

source: You are logged in single user mode, but there are active users in the database.
ru: Вы вошли в монопольном режиме, но в базе есть активные пользователи.

source: For this user single-user mode not allowed.
ru: Для этого пользователя монопольный режим не разрешен.

source: Single-user mode
ru: Монопольный режим

source: Site:
ru: Сайт:

# strconsts.rssize
source: Size
ru: Размер

source: Size/Prec
ru: Размер/Точн.

source: SNILS
ru: СНИЛС

source: You have enabled soft data entry validation. If you have configured the user role so that some fields are hidden or cannot be edited, then these fields do not require entering or validating values.
ru: Вы включили мягкую проверку ввода данных. Если вы настроили роль пользователя так, что некоторые поля скрыты или нельзя редактировать, то для этих полей не требуется ввод или проверка значений.

# strconsts.rssoftcheckvalues
source: Soft check of values
ru: Мягкая проверка значений

# strconsts.rssolid
source: Solid
ru: Сплошная

# strconsts.rssort
source: Sort
ru: Сортировка

source: Z-A
ru: Я-А

source: Source
ru: Источник

source: Source filter
ru: Фильтр источника

source: Source not select.
ru: Источник не выбран.

source: Source %d
ru: Источник %d

source: Source table
ru: Таблица-источник

source: Source table filter
ru: Фильтр таблицы-источника

# strconsts.rssourcetype
source: Type
ru: Тип

source: Spacing
ru: Расстояние

source: Specified size
ru: Заданный размер

source: Expected closing square bracket.
ru: Ожидается закрывающая квадртаная скобка.

source: SQL Editor
ru: Редактор SQL

source: SQL expression
ru: SQL выражение

source: Field with same SQL name already exists.
ru: Поле с таким SQL-именем уже существует.

source: SQL Name
ru: SQL-имя

source: SQL text is successfully copied to the clipboard.
ru: Текст SQL успешно скопирован в буфер обмена.

source: Source field not selected.
ru: Поле таблицы-источника не выбрано.

source: Source table not selected.
ru: Таблица-источник не выбрана.

source: Stack
ru: Стек

source: Star
ru: Снежинка

source: Start
ru: Начинать

source: Started
ru: Начало

source: Startup action
ru: Действие при запуске

source: Startup actions
ru: Действия при запуске

source: Start with
ru: Начать с

source: Browse
ru: Просмотр

# strconsts.rsstatusedit
source: Edit
ru: Правка

# strconsts.rsstatusinsert
source: Insert
ru: Вставка

source: Database
ru: База данных

source: Step Into
ru: Шаг со входом

source: Step Into <F7>
ru: Шаг со входом <F7>

source: Step Over
ru: Шаг в обход

source: Step Over <F8>
ru: Шаг в обход <F8>

source: Folder
ru: Папка

source: Link
ru: Ссылка

source: Storage folder not specified.
ru: Не указана папка хранения.

source: Storage type
ru: Способ хранения

source: Structure
ru: Структура

source: Style
ru: Стиль

source: Subsection
ru: Подраздел

source: Subtotal (column)
ru: Промежуточный итог (столбец)

source: Subtraction
ru: Вычитание

source: Success
ru: Порядок

source: Success message
ru: Сообщение об успехе

source: Sum
ru: Сумма

source: Summary
ru: Сводка

source: Support:
ru: Поддержка:

source: Support new databases (*.DXDB)
ru: Поддержка новых баз данных (*.DXDB)

source: Are you sure you want to switch to builder mode? Please note that after saving the settings, the SQL expression will be cleared.
ru: Вы точно хотите переключиться в режим построителя? Обратите внимание, что после сохранения настроек SQL выражение будет стерто.

source: Are you sure you want to switch to SQL mode? Please note that after saving the SQL expression, your previous settings will be cleared.
ru: Вы точно хотите переключиться в режим SQL? Обратите внимание, что после сохранения SQL выражения ваши предыдущие настройки будут стерты.

source: Switch to builder mode
ru: Переключиться в режим построителя

source: Switch to SQL mode
ru: Переключиться в режим SQL

source: Symbol frame
ru: Рамка символа

source: Symbol width
ru: Ширина символа

source: Table
ru: Таблица

source: The form [%s] has been changed 255 times. The limit on the number of database table changes has been reached. Use the GBAK utility to back up and restore the database.
ru: Форма [%s] была изменена 255 раз. Достигнуто ограничение на количество изменений таблицы базы данных. Сделайте с помощью утилиты GBAK резервное копирование и восстановление базы данных.

source: Table or Query
ru: Таблица или запрос

source: Tab order
ru: Порядок перехода

source: Tabs
ru: Закладки

source: Tab
ru: Закладка

source: Tab stop
ru: Переход по Tab

source: Tag {%s without a closing bracket }.
ru: Тег {%s без закрывающей скобки }.
