Repository: dxbit/dataexpress
Catalog: _test/languages/*/dataexpress.*.po
Languages: ru

source: Take the selected text in curly brackets
ru: Взять выделенный текст в фигурные скобки

source: Take the selected text in double quotes
ru: Взять выделенный текст в двойные кавычки

source: Take the selected text in single quotes
ru: Взять выделенный текст в одинарные кавычки

source: Take the selected text in square brackets
ru: Взять выделенный текст в квадратные скобки

source: Take value
ru: Извлечь значение

source: Template file
ru: Файл шаблона

source: Template file %s not found.
ru: Файл шаблона %s не найден.

source: Templates
ru: Шаблоны

source: Template files *.docx, *.docm, *.odt, *.ods, *.xml, *.html|*.docx;*.docm;*.odt;*.ods;*.xml;*.html
ru: Файлы шаблонов *.docx, *.docm, *.odt, *.ods, *.xml, *.html|*.docx;*.docm;*.odt;*.ods;*.xml;*.html

source: Templates folder
ru: Папка шаблонов

source: Template unknown
ru: Шаблон не определен

source: Template wizard
ru: Мастер шаблонов

source: Test
ru: Тест

source: Test form
ru: Тест формы

source: Errors were found during compilation. Open the script editor to fix the errors.
ru: Во время компиляции были найдены ошибки. Откройте редактор скриптов, чтобы исправить ошибки.

source: Test input
ru: Проверка ввода

# strconsts.rstext
source: Text
ru: Текст

source: Text alignment in data cells
ru: Выравнивание текста в ячейках данных

source: Text alignment
ru: Выравнивание текста

source: Text color
ru: Цвет текста

source: Text editor
ru: Редактор текста

source: Text length exceeded. Adding text to a memo is not possible.
ru: Длина текста превышена. Добавление текста в заметку невозможно.

# strconsts.rstextpropnotavail
source: This property is not available for a calculated label.
ru: Это свойство недоступно для вычисляемого поля.

source: Text too long (%d > %d).
ru: Текст слишком длинный (%d > %d).

source: There is a problem
ru: Есть проблема

source: This command does not apply to a simple form.
ru: Эта команда не применима к простой форме.

source: This group already exists.
ru: Такая группа уже есть.

source: This month
ru: Этот месяц

source: This week
ru: Эта неделя

source: This year
ru: Этот год

source: Thumbnail
ru: Миниатюра

source: Thumbnail size
ru: Размер миниатюры

source: Ticks
ru: Деления

source: Time
ru: Время

source: Time format
ru: Формат времени

# strconsts.rstitle
source: Title
ru: Заголовок

source: Today
ru: Сегодня

source: Tools
ru: Сервис

source: Too many indexes, can not add index. In some form, there are too many date fields or objects. To resolve this issue you need to review the structure of the form, remove unnecessary objects and date fields.
ru: Слишком много индексов, не могу добавить индекс. В какой-то форме слишком много полей дат или объектов. Для устранения ошибки необходимо пересмотреть структуру формы, удалить лишние объекты и поля дат.

source: Top center
ru: Вверху

source: Top left
ru: Вверху слева

source: Top right
ru: Вверху справа

source: Top side
ru: Верхняя сторона

# strconsts.rstotal
source: Total
ru: Итог

source: Total function
ru: Итоговая функция

source: Totals
ru: Итоги

source: Totals with same caption already exists.
ru: Итог с таким названием уже существует.

source: Transparency
ru: Прозрачность

source: Tree
ru: Дерево

source: [All]
ru: [Все]

source: (filter)
ru: (фильтр)

source: If there is a tree in the list window
ru: При наличии дерева в окне списка

source: Triangle
ru: Треугольник

source: Type name
ru: Имя типа

source: Unable find a supported file manager from list: Nautilus, Thunar, Nemo, Dolphin, PCManFM.
ru: Не удалось найти поддерживаемый менеджер файлов из списка: Nautilus, Thunar, Nemo, Dolphin, PCManFM.

source: Unable to find grid column. Make sure you entered the correct component name.
ru: Невозможно найти столбец таблицы. Проверьте правильность ввода имени компонента.

source: Uncheck all
ru: Снять отметку

source: Undefined alias or form name: %s
ru: Неопределенный псевдоним или имя формы: %s

source: Underline <Ctrl-U>
ru: Подчеркнутый

source: Undo
ru: Отменить

source: Unexpected token %s
ru: Неожиданный символ %s

source: Unfold all code
ru: Развернуть весь код

source: Unknown
ru: Неизвестно

source: Unknown Identifier
ru: Неизвестный идентификатор

source: Unknown module: %s
ru: Неизвестный модуль: %s

source: Unknown tag: %s
ru: Неизвестный тег: %s

source: Unlimited
ru: Неограниченный

source: Unordered list
ru: Неупорядоченный список

source: Unsuccessfull compile
ru: Неудачная компиляция

source: Updates database content
ru: Содержимое базы обновлений

source: File size: %s | File changed: %s
ru: Размер: %s | Изменен: %s

source: Update error
ru: Ошибка обновления

source: Updates
ru: Обновления

source: Updates database
ru: База обновлений

source: Database is empty
ru: В базе данных пусто

source: Updates database path
ru: Путь к базе обновлений

source: The path to the updates database was not set.
ru: Не указан путь к базе обновлений.

source: Database unavailable
ru: База данных недоступна

source: Update settings
ru: Настройки обновления

source: Upload files error
ru: Ошибка загрузки файлов

# strconsts.rsuploadfilestoupdatesdbmsg
source: The files you select will overwrite the contents of the update database. Continue?
ru: Выбранные вами файлы перезапишут содержимое базы обновлений. Продолжить?

source: Upload selected files into database
ru: Загрузить выбранные файлы в базу

source: URL pattern to search for
ru: Шаблон URL для поиска

source: URL was successfully copied to clipboard:%s
ru: Ссылка была успешно скопирована в буфер обмена:%s

# strconsts.rsuser
source: User
ru: Пользователь

source: User "%s" is already logged.
ru: Пользователь "%s" уже выполнил вход.

source: User manual
ru: Руководство пользователя

source: User module
ru: Модуль пользователя

source: User modules
ru: Модули пользователя

source: User modules (*.pas)|*.pas|
ru: Модули пользователя (*.pas)|*.pas|

source: User monitor
ru: Монитор пользователей

source: Username
ru: Имя пользователя

source: Users
ru: Пользователи

source: An error occurred while validating the action:%s
ru: Во время проверки действия произошла ошибка:%s

source: Value
ru: Значение

source: Value axis
ru: Ось значений

source: Value from form
ru: Значение из формы

source: Values
ru: Значения

source: Variable name
ru: Имя переменной

source: Version
ru: Версия

# strconsts.rsvert
source: Vertical
ru: По вертикали

source: Vert center
ru: По центру вертикали

source: Vertical bars
ru: Гистограмма

source: Vertical grid
ru: Вертикальная сетка

source: Vertical lines
ru: Вертикальные линии

source: Video lessons
ru: Видеоуроки

source: Viewing
ru: Просмотр

source: %s (View only)
ru: %s (Просмотр)

# strconsts.rsviewtype
source: View
ru: Представление

source: Visible
ru: Видимое

source: Visible buttons
ru: Видимые кнопки

source: Visible captions
ru: Видимые надписи

source: Warning
ru: Внимание

source: Extensions web module
ru: Веб-модуль расширений

source: Extensions web modules
ru: Веб-модули расширений

source: Web extensions modules (*.wepas)|*.wepas|
ru: Модули веб-расширений (*.wepas)|*.wepas|

source: Web form modules (*.wfpas)|*.wfpas|
ru: Модули веб-форм (*.wfpas)|*.wfpas|

source: Web page
ru: Веб-страница

source: Monday Tuesday Wednesday Thursday Friday Saturday Sunday
ru: Понедельник Вторник Среда Четверг Пятница Суббота Воскресенье

source: Mon Tue Wed Thu Fri Sat Sun
ru: Пн Вт Ср Чт Пт Сб Вс

source: Welcome to %s!
ru: Добро пожаловать в %s!

source: When printing
ru: При печати

source: Whole words
ru: Целые слова

source: Width
ru: Ширина

source: Without grid
ru: Только форма

source: Word Document
ru: Документ Word

source: Word wrap
ru: Перенос слов

# strconsts.rsyes
source: Yes
ru: Да

source: Yes to all
ru: Да для всех

source: You can not delete the current user.
ru: Нельзя удалить текущего пользователя.
